[{
        "url": "https://financialenergyreview.com/2021/12/08/aiteo-successfully-stops-nembe-wellhead-oil-spill/",
        "headline": "FIANACIAL ENERGY REVIEW: Aiteo Successfully Stops Nembe Wellhead Oil Spill",
        "author": "Posted by:  admin",
        "date": "December 8, 2021",
        "paragraphs": [
            "Aiteo, operator of the Nigerian National Petroleum Corporation/Aiteo Joint Venture (JV), Oil Mining Lease (OML) 29, Wednesday succeeded in shutting down the leak on its Santa Barbara wellhead in Nembe, Bayelsa state.",
            "The company had on Friday, November 5, 2021, reported a hydrocarbon wellhead leak on the facility to the Nigerian authorities.",
            "Aiteo had stated that the well which the company acquired in 2015, had been mostly dormant and had been securely isolated since then, adding that the leak was a high pressure one and therefore needed international support.",
            "Also in preparation for the “well kill”, Aiteo had raised a team comprising members from its internal well operations experts as well as a foreign firm, Boots & Coot to hasten the operation.",
            "That was in addition to the earlier mobilisation of the Clean Nigeria Associates (CNA), a Nigerian coalition, as part of the attempt to halt the leak which was said to comprise about 20 per cent oil and 80 per cent gas.",
            "A statement from the company on the latest development stated that the leak has now been fully halted while other steps were being taken to consummate the process that started a few weeks ago.",
            "“To the glory of God, we have put out the leak at SBAS-1. We are grateful for all the support. We have successfully installed control packages on both arms.",
            "“ There’s a rig up pump on the long string and pump opens the ball valve. Also, we have closed both control packages and shut-in well flow. The team is currently preparing to pump ‘kill fluid’ into the long string. Note that the short string is already killed and dead with zero pressure,” it said in the note.",
            "On the next number of steps, the indigenous oil firm said it will: “Complete pumping of kill fluid into the long string (LS). Achieve zero psi on surface and rig down pump as well as rig up wireline.”",
            "In addition, it stated that another step was being taken to drift both ‘tubings’ and run in hole to install isolation plugs and non-return valves.",
            "“ We will then nipple down Christmas Tree and carry out comprehensive service on wellhead and Christmas Tree as well as install it and secure well. Thereafter, we will clean-up wellhead platform and surroundings,” the statement noted."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/11/26/bua-finnish-firm-seal-70mw-gas-power-plant-deal/",
        "headline": "FIANACIAL ENERGY REVIEW: BUA, Finnish Firm Seal 70MW Gas Power Plant Deal",
        "author": "Posted by:  admin",
        "date": "November 26, 2021",
        "paragraphs": [
            "BUA has signed another agreement with Wartsila OY of Finland for the construction of a 70megawatts dual-fuel power plant for its BUA Cement Obu Line 3 project in Edo State, Southern Nigeria.",
            "Founder/Executive Chairman, BUA Group, Abdul Samad Rabiu, and Deputy Minister for International Trade for Finland, Ms. Nina Vaskunlahti when the Deputy Minister paid a courtesy call on the Chairman at the BUA Regional Office in Abuja.",
            "This agreement was signed between both companies at a ceremony in Abuja presided over by the Deputy Minister for International Trade for Finland, Ms. Nina Vaskunlahti.",
            "The gas power plant will also be the third power plant to be commissioned by BUA from Wartsila as the cement firm seeks to increase its total production capacity across all its locations to 17million metric tonnes by 2023.",
            "Speaking at the signing ceremony, Abdul Samad Rabiu, Chairman of BUA, who signed on behalf of the cement producer, said that BUA was committed to utilizing cleaner, more efficient energy sources for its cement operations rather than relying on coal or heavy fuels.",
            "According to Rabiu, the 70MW gas-powered plant ordered by BUA for its Obu Line 3 cement plant will ensure that the company remains very efficient in its energy utilization in the cement production process.",
            "“Currently, we have phased out the use of coal across our factories and are shifting to gas-powered plants. As we ramp up our capacity, there is a need to complement it with efficient power supply and Wartsila’s technology has been found to be durable and uniquely aligned with our vision for more efficient power generation at all our production locations,” Rabiu added.",
            "BUA Cement Plc is Nigeria’s second-largest cement company and the largest producer in its North-West, South-South, and South-East regions. BUA Cement operates strategically from Okpella, Edo State and Kalambaina, Sokoto State with its headquarters in Lagos, Nigeria.",
            "Currently the second most capitalized manufacturing company on the Nigerian Stock Exchange (NSE), BUA Cement is committed to quality – a differentiating attribute, driven by its people, innovation, and technology; and positioned to solve West Africa’s cement, housing, and infrastructure deficit while driving economic growth and development."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/12/01/nape-new-president-harps-on-core-values-for-the-oil-industry/",
        "headline": "FIANACIAL ENERGY REVIEW: NAPE New President Harps on Core Values for the Oil Industry",
        "author": "Posted by:  admin",
        "date": "December 1, 2021",
        "paragraphs": [
            "Dr. James Edet the new President of Nigeria Association of Petroleum Explorationists (NAPE), one of the largest body of Geoscience and earth science in the oil and gas space in Sub Saharan Africa has reiterated the need to emphasize the industry’s core values.",
            "Dr. James Edet, who works for Totalenergies will now be the 44th President of NAPE. He spoke to journalists at a media parley to appreciate his appointment and unveil plans of the association under his leadership for the next one year.",
            "Dr. Edet acknowledges the task before him as the new NAPE president. According to him, this opportunity to take on this prestigious yet tasking industry representation, is a show of premium placed on the industry core values.",
            "“Our five core values of performance-minded attitude, a pioneer spirit, safety, respect for each other, and the need to stand together, all of these have been demonstrated during my tenure as President-elect and chairman, conference planning committee in this recently concluded conference” he said.",
            "He stated further: “In 1975, when Akomeno Oteri together with his peers started NAPE, they sure had audacious goals. NAPE, currently at 46years, have created numerous opportunities for oil explorationists and geoscientists in Nigeria and today, at over 12000 registered members strong, we are privileged by the courageous act of this young man and his pioneering friends, many of whom are still with us till-date.”",
            "The NAPE President revealed that his administration will kickstart as soon as he gets details of handing over from his predecessor Mrs. Patricia Ochogbu who has transitioned to become the immediate past President and acts on advisory capacity.",
            "According to Dr. Edet, “In the days ahead, focus will be on our future, but for now, it is imperative to truly reflect on the past years, especially the last two and stay thankful to the resilience of NAPE members, their learning and agile mindset and approach to delivery. The past year have been a rocky one for our industry, from COVID19 pandemic, Energy Transition and accompanying pluri-dimensional issues to the current Petroleum Industry Act whose execution details are currently been worked.”",
            "He pointed out clearly that NAPE under his leadership will continue to steadfastly advocate for Geosciences advancement and integration, recommend and advise on policy initiatives that will add continuous value to the upstream business and create the platform for upstream petroleum industry stakeholders to share knowledge.",
            "There will be network and collaboration in the development of the upstream petroleum industry in Nigeria.",
            "Expressing concerns for the oil and gas industry, the NAPE helmsman said there are obvious facts to be considered in the industry:",
            "Oil production in Nigeria has decreased to an average of 1.6million barrel per day with Nigerian Upstream Petroleum Regulatory Commission (NUPRC) commitment to increase reserves to 40 billion barrels and raise production to three (3) million barrels per day.",
            "Global Energy Transition agenda of limiting the global average temperature to 1.5oC, with focus on reducing energy generated from fossil fuel sources.",
            "Reduction in upstream investment opportunities amidst a structured fiscal framework enacted within the Petroleum Industry Act (PIA, 2021).",
            "Covid-19, accompanying variant(s) and its lingering impact. The future of work, role of digitalisation, Artificial Intelligence, virtual and collaborative tools that can optimize value delivery. Amongst several other pertinent issues.",
            "With these foregoing, Dr. Edet explained that NAPE will continue to create a strong platform for its members and member organization to continually seek the optimal value from exploration and production activities, as the association is convinced beyond reasonable doubt that oil and gas will remain a predominant source of energy in the next few decades, amidst the energy mix.",
            "“From the outcome of our successful conference, we see that the pandemic truly endangered the health and safety of the environment, our industry, and its workforce, with most of our members still working from home or in skeletal rotations. This continues to emphasize our nation and continent’s unique need of leading people out of energy poverty, hence climate change mitigation plans for us will continue to seek redress on creating a “just” energy transition strategy for our nation as we all earnestly join forces to ensure that we support our member organizations to bring production up to an economically dependable level, keep the flare out and embrace other alternative energy source in the mix, as we transition.”",
            "He said NAPE’s mantra “Our ideas find Oil and Gas” continues to steward the association into a future of exploration activities to replace produced reserves and harness the huge gas potential of Niger Delta.",
            "“The landscape shows that we must brace up for newer changes in our ways of working, and one of our goals will be to position and equip our members with new skills for their future workplace agility and adaptability.",
            "NAPE also offers a unique approach at collaborating for Research and Development with our Academia community, this initiatives through our University Assistance Program will be further strengthened and support to foster an open channel for cross exchange of ideas and conducive career and personnel growth in petroleum operations.”",
            "Dr. Edet said the association’s activities last year will be the benchmark for 2022 activities, and the executives will continue to work earnestly with other members to ensure that it continues to provide appropriate membership and industry value.",
            "“We will continue to offer practical industry support through our external advocacy with our regulatory agencies, collaboration within the international Oil companies, the Independents Oil Companies, the Marginal operators, service, and consulting organizations and all members at large.",
            "Our ideas find Oil and Gas continues to steward us into a future of exploration and production activities to be able to lift our nation out of energy and socio-economic poverty.”",
            "Responding to questions about recent trends in the industry with regards to International Oil Companies (IOC) divestment and exiting from Nigeria, Dr. Edet said the IOCs are only selling assets in the onshore while they remain active in deep water.",
            "The NAPE President said in spite concerns of energy transition and the advent of renewables, fossil fuel still remain relevant in the value chain.",
            "On what NAPE will be doing in case oil is extinct arising from energy transition, he said other possibilities are in the industry that members can still be involved. Gas is a clean energy which also form part of the transition adding that Geoscience and other aspects evolve in the industry which members can do to keep afloat in the industry.",
            "Journalists also raised concerns about some IOCs which did not show their presence at the conference except for TotalEnergies which exhibited. Dr. Edet disclosed that due to Covid-19 some IOCs were busy to recover from work loss and sending their staff to exhibition might be difficult. However, some of them played active roles and participated in some of the sessions at the conference.",
            "He advised the government to ensure Nigeria is protected and safeguard from new omicron variant which has been discovered in some countries."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/12/13/nnpc-records-%e2%82%a6141-96-billion-trading-surplus/",
        "headline": "FIANACIAL ENERGY REVIEW: NNPC Records ₦141.96 Billion Trading Surplus",
        "author": "Posted by:  admin",
        "date": "December 13, 2021",
        "paragraphs": [
            "The Nigerian National Petroleum Company (NNPC) Limited has announced a huge leap in trading surplus of ₦141.96billion recorded in June 2021 compared to a deficit of ₦37.46Billion in May 2021.",
            "This is contained in the June 2021 figures of the NNPC Monthly Financial and Operations Report (MFOR).",
            "A trading surplus or trading deficit is derived after deduction of the expenditure profile from the revenue for the period under review.",
            "In June 2021, NNPC Group operating revenue as compared to May 2021, decreased by 9.07% or N89.27billion to stand at N894.64billion. Similarly, expenditure for the month decreased by 29.32% or N299.44billion to stand at N721.93billion.",
            "Thus, in the period under review, expenditure as a proportion of revenue was 0.81%, compared to the figure in May which stood at 1.04%.",
            "The report also noted that the increase in trading surplus was due mainly to the increased sales of crude oil and gas by the Nigerian Petroleum Development Company (NPDC), an Upstream subsidiary of the NNPC, and the increased gas sales and depreciation postings by the Nigerian Gas Company (NGC).",
            "The positive outlook was further bolstered by the performance of Duke Oil and the Nigerian Gas Marketing Company (NGMC) which also added to the improved bottom line.",
            "According to the report, a total of 1.63bn litres of PMS translating to 54.50mn liters/day were supplied in June 2021. This was to ensure continuous supply and effective distribution of Premium Motor Spirit (PMS) across the country",
            "The report indicated that in June 2021, 47 pipeline points were vandalized representing 26.56% decrease from the 64 points recorded in May 2021. Port Harcourt Area accounted for 43%, while Mosimi and Kaduna Areas accounted for 51% and 6% respectively of the vandalized points.",
            "In the gas sector, a total of 223.77billion cubic feet (bcf) of natural gas was produced in the month of June 2021 translating to an average daily production of 7,459.88million standard cubic feet per day (mmscfd).",
            "For the period of June 2020 to June 2021, a total of 2,890.11bcf of gas was produced representing an average daily production of 7,321.36mmscfd during the period.",
            "Period-to-date production from Joint Ventures (JVs), Production Sharing Contracts (PSCs) and NPDC contributed 59.84%, 20.26% and 19.90% respectively to the total national gas production.",
            "The 71st edition of the MFOR highlights NNPC’s activities for the period of June 2020 to June 2021.",
            "In line with its commitment to transparency and accountability, NNPC has continued to sustain effective communication with stakeholders through this report via publications on its website, independent online news portals and in national dailies."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/12/04/nnpc-seeks-appropriate-pricing-to-boost-gas-sector/",
        "headline": "FIANACIAL ENERGY REVIEW: NNPC Seeks Appropriate Pricing to Boost Gas Sector",
        "author": "Posted by:  admin",
        "date": "December 4, 2021",
        "paragraphs": [
            "………by James Ikenna……..The Nigerian National Petroleum Company (NNPC) Limited is advocating for appropriate Pricing of gas without which it will be impossible to fully develop the sector",
            "Speaking on the third day of the Practical Nigerian Content (PNC) Conference in Bayelsa, organised by the Nigerian Content Development and Monitoring Board (NCDMB), Group Executive Director, Gas and Power, NNPC, Abdulkabir Ahmed, also called for appropriate pricing for electricity to attract investment. He said to ensure cleaner energy sources, Nigeria had to refocus its energy mix, deepen the usage of gas, and draw funding into the sector.",
            "Ahmed pointed out that funding was a big challenge in the oil and gas industry, advising that the sector should leverage on technology and experience to weather the shortage of projects financing.",
            "“Today, funding for fossil fuels is generally low and, therefore, it poses a lot of challenge. However, we cannot do without investment in this sphere. Therefore, we need to leverage on technology, leverage on industry experience, so as to produce more with less cost.",
            "“The second area that we look at is gas and power. Now, gas and power work together, because the power is fuelled by gas. So, in as much as you’re looking at your opportunity, we have to look at where the gas will come from, who provides the gas?",
            "“Where do we also get the gas for use? Do we have adequate infrastructure to move the gas around, to utilise the gas for what is useful as well as put up adequate skills to ensure that we boost production, transmission and transportation?",
            "“All these are not obtainable except we have a transparent and market-driven gas market as well as electricity pricing. Without that, it will be difficult to go back to the upstream and put in money if you have no feasibility about upstream costs” he said",
            "He noted that power generation was dependent on gas, especially for heavy duty industries, stressing that efforts are on to bring in vehicles that would run on gas as well as the skills to improve domestic gas production.",
            "Ahmed called for regional and international cooperation in the areas of gas production, transportation, and utilisation, especially for power generation.",
            "He said, “We need to develop an appropriate gas pricing as well as policies and investment packages. The Petroleum Industry Act (PIA) has done some significant improvement on some of the existing laws on gas.",
            "“It has opened up some bottlenecks that used to exist. Therefore, there are now several opportunities. Moreover, you have a lot of areas for investors to come in and put their money. They can look at auto vehicles, power plants can come, heavy industries, petrochemicals, fertilisers etc.”",
            "In his remarks, Ogunleye stated that most of the gas production in the country was under the control of foreigners, stressing that the situation is worrying.",
            "He said, “You will find that the majority of gas projects and events are driven by foreign nationals and it is a concerning situation. And so, we need this task of continuously engaging with the public to expose them to the opportunities.",
            "“Government has been pushing for gas development and the necessary environment has been created, whether through the PIA, the Decade of Gas, autogas, etc. All these are creating a spectrum of new opportunities around commercial opportunities. There are multiple opportunities even for small companies.",
            "“If you go downstream, you’ve got a bunch of new opportunities and new technologies. So, all across the spectrum, there are opportunities. The question is, how do we maximise and take advantage of these opportunities.”",
            "Ahmed spoke on the same panel that had Managing Director/Chief Executive Officer, Gas Aggregation Company of Nigeria (GACN), Olalekan Ogunleye; Managing Director, Shell Nigeria Gas, Ed Ubong; Managing Director/Chief Executive Officer, ND Western, Eberechukwu Oji; and Director, Services and Offshore, Oilfield Equipment, Baker Hughes, Stephen Adeyemo."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/11/18/orjiako-steps-down-as-chairman-seplat-energy-to-exits-board-may-next-year/",
        "headline": "FIANACIAL ENERGY REVIEW: Orjiako  Steps Down as Chairman Seplat Energy to  Exits Board May  Next Year",
        "author": "Posted by:  admin",
        "date": "November 18, 2021",
        "paragraphs": [
            "Seplat Energy Plc announces the decision of its Chairman, Dr. A.B.C. Orjiako to step down as Chairman and from the Board of Directors of Seplat Energy Plc.",
            "Mr Stanley Opara, Manager, Media Communications said in a statement that Orjiako notified the Board of Directors of his decision today, November 17, 2021.",
            "According to him, In order to facilitate an orderly transition Dr Orjiako will remain as Chairman until the next Annual General Meeting in May 2022, when an Independent Chairperson will take over.",
            "A.B.C. Orjiako is the co-founder and pioneer of Seplat Energy. Since 2009, as Chairman of the Seplat Energy Group, Dr. Orjiako has taken the Company through a number of acquisitions and was the driving force behind Seplat Energy becoming the first and only Nigerian corporate to dual list on the Nigerian Stock Exchange and the Main Board of the London Stock Exchange in 2014.",
            "The Board of Seplat Energy thanked its Chairman for his strategic vision, drive and limitless energy to create Nigeria’s leading indigenous independent energy company.",
            "Dr. A.B.C. Orjiako, Chairman of Seplat Energy plc, commented: “The past twelve years at Seplat Energy have been exhilarating for me. As Chairman, I am proud that the Board, Management and entire Staff of Seplat Energy were able to achieve several enviable milestones and exceptional successes, notably the acquisition of eight oil and gas assets, expansion of the Oben and development of the ANOH gas plants and the dual listing on both the Nigerian and London Stock Exchanges – a first by a Nigerian company”.",
            "“While there were challenges along the way, we overcame these by the special grace of God, the outstanding performance and professionalism of each member of the Board and Management, and the sterling efforts of our staff. I will continue to give my utmost energy and commitment to the Company until I step down from the Board at the next AGM,” he said.",
            "Mr. Basil Omiyi, a Senior Independent Director of Seplat Energy plc, commented: “On behalf of all members of the Board, I would like to thank Dr A.B.C. Orjiako for his immense contribution as a co-founder and Chair of Seplat Energy since inception.”",
            "“He has been Chairman during both exciting and challenging times, and his dedication has been constant throughout.",
            "“The Board and Management look forward to working with him during the transition period and we will miss his insight, expertise and leadership when he finally steps down in May,” Omiyi said.",
            "The Seplat Energy Chairman’s decision to step down and be replaced by an Independent Chairperson is a testament to the strong corporate governance and best practices he instilled in the Board."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/11/11/nigerian-oil-companies-en-route-to-uganda-ambassador/",
        "headline": "FIANACIAL ENERGY REVIEW: Nigerian Oil Companies  En Route to Uganda – Ambassador",
        "author": "Posted by:  admin",
        "date": "November 11, 2021",
        "paragraphs": [
            "Ugandan High Commissioner to Nigeria, Ambassador Nelson Ocheger, says six Nigerian companies have indicated interest to invest in Uganda oil and gas industry.",
            "Ocheger made this known in an interview at the ongoing 2021 Lagos International Trade Fair (LITF) on Tuesday in Lagos.",
            "The fair is holding from Nov. 5 to Nov. 14 and has as its theme: “Connecting Businesses, Creating Value.”",
            "Over 200,000 visitors are expected while about 1,500 exhibitors from 16 countries are participating in the 35th edition of the fair.",
            "He said Uganda was set to produce its first oil as early as 2025 and production in the next five years was expected to jump to 230,000 barrels per day, from zero in 2021.",
            "He said: “We have started exploring our oil reserves. We hope that by 2025, we will be able to start selling crude refined in Uganda.",
            "“We are currently constructing a refinery, we are building pipelines and an airport to service that industry in Western Uganda.",
            "“We are expecting to produce and it is very attractive to investors and six Nigerian companies have already shown interest.”",
            "Ocheger said the projects were being executed using Public Private Partnership model and was attracting investors.",
            "He noted that Nigeria was the biggest oil producer in Africa with vast years of experience in the sector.",
            "Ocheger explained that strengthening of ties between Uganda and Nigeria was very important for economic growth and development.",
            "The high commissioner said Uganda’s visa regime was very friendly and seamless to attract more investors and visitors to the country.",
            "“We now encourage applicants to do it online and you are given a code which you can present at any port of arrival as long as you have met all the requirements.",
            "“However, we are looking at piloting visa on arrival for holders of diplomatic, official and service passports.",
            "“Once that succeeds, we hope to roll it to all the sections of the population who are eligible to visit Uganda.",
            "“We also have business visa for investors which is processed on a case by case basis,” he said.",
            "Ocheger said Uganda offers several investment opportunities in areas such as agro-business, tourism, value addition for minerals, infrastructure, energy and information communication technology.",
            "He said the country enjoys a favourable economic environment, excellent fiscal and monetary policies, political stability, skilled workforce and good security.",
            "The high commissioner said Uganda also offers both local and regional market for investors being a dominant player in the East African bloc."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/11/24/fg-plans-reducing-tariff-on-lpg-and-its-accessories-to-check-prices-of-domestic-cooking-gas/",
        "headline": "FIANACIAL ENERGY REVIEW: FG Plans Reducing Tariff  on LPG and It’s Accessories to Check Prices of Domestic Cooking Gas",
        "author": "Posted by:  admin",
        "date": "November 24, 2021",
        "paragraphs": [
            "The federal government is set to bring down the price of Liquefied Natural Gas (LPG) cooking gas through the reduction of tariff and taxes on imported LPG and it’s accessories.",
            "The Minister of State for Petroleum Resources, Chief Timipyre Sylva said that the government is planning to reduce the price of gas for the Yuletide.",
            "He stated that it was making efforts to reduce the cost of the commodity and make it affordable for Nigerians ahead of the Yuletide.",
            "However he pointed out that the government has no direct control over the rising prices of LPG, and cannot regulate it as it is an International commodity just like the crude oil",
            "Sylva, disclosed this on Tuesday after a meeting with the President, Muhammadu Buhari. At the meeting, Sylva formally presented the chief executives of the Nigerian Midstream and Downstream Petroleum Regulatory Authority and the Nigerian Upstream Petroleum Regulatory Commission, Farouk Ahmed and Gbenga Komolafe, respectively.",
            "Speaking on the reasons for LPG price hike, the minister said, “Cooking gas is not subsidised. It is already a deregulated commodity. So, the price of cooking gas is not determined by the government or by everybody in the industry. Gas prices are determined internationally.",
            "“And you all are aware that in Europe today, gas prices have gone up. There was even crisis in Europe relating to gas prices. The pricing of gas internationally now affects also the price of gas in the country.",
            "“Apart from that, there are some issues around VAT charges on imported gas, and of course, taxes on imported gas, which we are handling. But of course, quite frankly, these taxes on imported gas, you must also juxtapose it with the local producers of gas.”",
            "Sylva also said the President had directed him and his team to go and examine the oil spillage in Nembe, Bayelsa State.",
            "Speaking on what was behind the reappearance of queues in filling stations across the country, Ahmed said some of depot owners were selling petrol above the official ex-depot price of N148/litre, as they sold the product for as high as N157/litre.",
            "“And the reason they adduced is that they are paying for their logistics such as shipping in dollars, they are also paying for NPA port charges and NIMASA charges in dollars,” he said.",
            "The NMDPRA boss said the government had met with operators in the downstream sector on the matter, adding that efforts were on to settle the concerns."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/11/19/pipeline-vandalism-nosdra-dg-tasks-host-communities-on-advocacy/",
        "headline": "FIANACIAL ENERGY REVIEW: Pipeline Vandalism: NOSDRA DG Tasks Host Communities on Advocacy",
        "author": "Posted by:  admin",
        "date": "November 19, 2021",
        "paragraphs": [
            "Director-General, National Oil Spill Detection and Response Agency (NOSDRA), Mr dris Musa, has urged host communities and stakeholders to embark on advocacy and protect their immediate environment against pipeline vandalism.",
            "Musa stated this on Wednesday in Akure during a sensitisation programme on Community-Based Disaster Risk Reduction Plan on the dangers of pipeline vandalism and the resultant environmental pollution.",
            "Represented by Director, General Service, NOSDRA, Mr Aliyu Rimgin, the director-general said that the Niger-Delta zone had been confronted with myriad of environmental problems threatening the ecosystem and livelihoods of people.",
            "Consequent upon this, he stressed the need for promoting collaboration by all stakeholders in addressing the menace, for sustainable development.",
            "Musa said the agency had developed a plan to create and sustain an interface with stakeholders to curb pipeline vandalism, which had resulted in adverse socio-economic, health and environmental conditions.",
            "He commended Ondo State government for its commitment to environmental management as well as its support for the agency’s drive toward achieving zero-tolerance to oil spill incidents in the environment.",
            "Also speaking, Gov. Rotimi Akeredolu said there was the need to proffer solution to the issue of vandalism, climate change and environmental degradation.",
            "Akeredolu, represented by Permanent Secretary, Ministry of Environment, Mr Akin Asaniyan, said that the sensitisation programme being embarked upon by the agency would address daunting issues surrounding the environment.",
            "Meanwhile, NOSDRA’s acting Director of Research, Mr Sola Oladipo, while speaking on the Oju Imole oil spillage in Ilaje Local Government area of the state, said that the agency had concluded investigations on the site, with all the necessary documents signed.",
            "Oladipo said the next stage was to get contractor for the clean-up of the site, saying that this was already in progress.",
            "He, however, said the responsibility of the impacted site would be borne by those who caused the spillage.",
            "Oladipo said all the analysis and information about oil spillage on individual states were being monitored and attended to.",
            "The stakeholders at the programme included: traditional rulers, selected people from Ondo South senatorial district, representatives of civil society organisations and security agents, among others.",
            "The stakeholders commended the organisers of the programme, describing it as an eye opener."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/10/22/fgll-retain-1500-staff-of-defunct-pppra-dpr-pef-sylva/",
        "headline": "FIANACIAL ENERGY REVIEW: FG’ll retain 1,500 staff of defunct PPPRA, DPR, PEF – Sylva",
        "author": "Posted by:  admin",
        "date": "October 22, 2021",
        "paragraphs": [
            "The Federal Government is to retain the about 1,500 employees of the defunct Department of Petroleum Resources, Petroleum Products Pricing Regulatory Agency and Petroleum Equalisation Fund.",
            "Minister of State for Petroleum Resources, Chief Timipre Sylva, said on Wednesday that no staff of the scrapped agencies would be sacked.",
            "He disclosed this while during meetings with employees of the affected organisations in Abuja.",
            "Sylva, who announced that he had stepped down as the chairman, Nigerian National Petroleum Corporation, supervised the handing over ceremonies at the agencies.",
            "Although he did not give the exact number of workers in the agencies, the daily payment data published on the open treasury portal in 2020 had put the number of staff of the defunct DPR at 610.",
            "Senior officials of the defunct PPPRA stated that the staff strength of the agency was about 400, as some of the workers also expressed fears of being fired following the scrapping of the agency. Also, it was learnt that the defunct PEF’s workforce was in the region of 400 workers.",
            "The DPR, PPPRA and PEF had all been officially scrapped in accordance with the Petroleum Industry Act.",
            "Sylva had also inaugurated the boards of the Nigerian Midstream and Downstream Petroleum Regulatory Authority and the Nigerian Upstream Regulatory Commission, the successor agencies of the scrapped DPR, PPPRA and PEF.",
            "In a bid to calm the fears and concerns of workers of the defunct organisations, Sylva went to the agencies on Wednesday and assured them that the Federal Government had no plan to fire workers.",
            "He said, “We assure you that this is a very normal transition. The PIA has been passed and the law stipulates that certain actions must be taken.",
            "“That the DPR, as it was then, must be wound down and two successor agencies are to be inaugurated. And, of course, I had to step down as chairman of NNPC. It is all because this is what the law states.”",
            "He made it clear that the political leaderships of the defunct agencies would have to give way for the newly appointed chief executives of the successor agencies.",
            "“But I want to assure you that the staff has nothing to worry about because the law is very clear also on the position of the staff of DPR, PEF and PPPRA.”"
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/12/03/gas-to-power-implications-of-fgs-domestic-supply-pricing/",
        "headline": "FIANACIAL ENERGY REVIEW: Gas to Power : Implications of FG’s Domestic Supply Pricing",
        "author": "Posted by:  admin",
        "date": "December 3, 2021",
        "paragraphs": [
            "Despite awareness, oil companies continue to flare gas, due partly to lack of infrastructure for processing and distribution to domestic and industrial users.",
            "Over the years, the federal government has made efforts to encourage investment in gas processing especially for the domestic market including providing incentives to oil companies.",
            "As part of the country’s resolve to become a major player in the international gas market as well as to lay a solid framework for gas infrastructure expansion, the Nigerian Gas Master Plan was approved in 2008. The Gas Master Plan has yielded results with increased investment in gas but this progress could be derailed by the recent directive by the Federal Government which reduced the price of gas to power under Domestic Supply Obligation (DSO) from $2.50/Mscf to $2.18/Mscf.",
            "In a surprising move during the 2021 Gas Sector Stakeholders Forum held in Kano in July, President Muhammadu Buhari announced a reduction of the price of gas to power from $2.50 to $2.18, “with immediate effect”.",
            "The President’s comment was followed by a letter to Gas Aggregation Company of Nigeria (GACN) titled ‘Ministerial Directive on Gas to Power in Nigeria’ signed by Bitrus Nabasu, Permanent Secretary, Ministry of Petroleum Resources, which conveyed the Ministerial approval for the gas price reduction.",
            "According to the letter, the Minister’s approval was based on the recommendation by the Ministerial Gas Price Review Committee which was adopted by the Federal Government, organised labour and the Technical Ad-hoc Committee as prescribed by the National Gas Supply and Pricing Regulations 2008.",
            "Analysts in the oil and gas industry have observed that the price reduction, a consequence of pressure on the government by labour unions, will be counterproductive because it could dampen investors’ appetite and impact gas supply to the domestic power market.",
            "According to data available on the International Energy Agency website, as of July 2021, gas was sold atc.$7/Mscfon the international gas market. This offers a more attractive opportunity for investors in the gas market.",
            "The Federal Government’s move is reminiscent of the premium motor spirit (PMS) price-fixing which has held back investment in refining in the downstream sector.",
            "The labour unions’ major argument is that a reduction in gas prices will translate to a reduction in electricity tariffs. However, industry analysts describe Labour’s position as simplistic. Their view is that price should be determined by market forces of supply and demand rather than by executive fiat. There is currently no equilibrium in the domestic gas market. According to Mordecai Ladan, former Director of the Department of Petroleum Resources (DPR), Nigeria’s daily gas production in 2019 was 1.2 billion standard cubic feet. Out of this volume, 41% is exported while 48% is retained for the domestic market. Flared gas accounts for 11% of the produced volume. With a domestic gas demand of over 1.4 billion standard cubic feet per day, the domestic market is supplied creating an imbalance which can be seen in the erratic supply to power generation plants for instance.",
            "A key reason why it does not make sense to reduce gas prices is that there is currently 40% liquidity in the gas to the power value chain. The government’s focus should rather be on increasing liquidity to 100% which will assure suppliers of their payment as and when due.",
            "The gas price reduction could threaten the progress so far made in tackling gas flaring through gas monetisation. As of 2018, gas flaring accounted for nearly a quarter of Nigeria’s total carbon dioxide emission, according to reports from the International Energy Agency and Nigeria’s National Oil Spill Detection and Response Agency. On the other hand, PwC estimates that in the period between 2014 and 2018, the country lost an estimated $4.3 trillion to gas flaring.",
            "This sad situation was sustained by poor investment in gas processing infrastructure as investors were unwilling to commit to an economy with a history of policy instability. The price directive by the Federal Government is a confirmation of the fears of potential investors who were hesitant about investing in the gas market in the past.",
            "It could pull Nigeria back to those days when it was just not logical to invest in a gas processing facility because of low prices and an unstable policy environment.",
            "There are some implications of leaving Labour’s relentless price push unchecked, according to Energy analysts. Firstly, investment in gas processing plants will stutter. Secondly, the price reduction for gas to power sector creates confusion/distortion for gas prices in the other market segments. Local distribution companies and other off-takers that are not in the gas to power value chain segment have started writing to suppliers to reduce pricing quoting the announcement by the Federal Government as a basis. The government needs to provide clarification on this. Thirdly, Generating Companies (Gencos) will again be starved of much-needed gas.",
            "In the end, the Nigerian electricity consumer will suffer and the country’s hope of becoming a gas super-power will remain an illusion.",
            "At present, Nigeria’s proven gas reserves stand at 206.5 trillion standard cubic feet (TCF) according to the Department of Petroleum Resources (DPR), whereas proven crude oil reserves are 36.9 billion barrels. By 2030, the DPR says Nigeria’s gas reserves will increase to 230TCF. This projection will be a mirage without increased investment to harness the abundant gas reserves.",
            "Also, it is estimated that Nigeria will need circa $400 billion between now and 2050 to power over 25 million homes. Gas is critical to powering these homes because nearly 90% of power plants in the country are gas-fired.",
            "If potential investors are muzzled with price control and poorly coordinated policies in the guise of reducing the cost of electricity tariffs how will the nation attract the necessary investment in gas to increase power generating capacity?",
            "In addition, gas producers will be forced to sell their output in the international gas market since pricing is more favourable and revenue is in dollars.",
            "There are several gas producers who have sourced funding in dollars based on certain price projections. The gas price reduction could derail their projections, impede their ability to repay loans sourced from banks and drive them out of business. Given that gas, infrastructure is funded in dollars but with revenues generated in Naira, government needs to provide viable concessionary infrastructure funding in Naira to further encourage investment in the upstream and midstream gas sectors.",
            "Of even deeper consequence is the implication of more flares emerging across the Niger Delta because of poorly conceived policies. Oil and gas exploration companies have been flaring a lot of gas across oil-producing communities in the Niger Delta every day. And community dwellers like Esoke have been at the receiving end, often complaining that the flares cause heat, damage to the eyes and general health.",
            "Since 2015, the price of gas for power generation under DSO has remained $2.50/Mscf notwithstanding changes in the international market as well as increases in the cost of gas infrastructure and cost inflation generally. Therefore, reducing the price of gas for power generation is not the right approach to deal with the power shortages and electricity tariff in Nigeria.",
            "The Solution",
            "The willing-buyer -willing-seller approach or market-driven pricing regime is a veritable solution for Nigeria to fully adopt. Improper price regulations and subsidies do not support the robust growth of the gas and power sectors. This explains why the liquidity issue in the power value chain has continued to linger.",
            "Vice President, Prof. Yemi Osinbajo indeed stated in 2019 that the willing-buyer- willing-seller policy is one of the surest steps to addressing Nigeria’s power challenges. Speaking at a town hall organised by Lekki Estates Residents and Stakeholders Association (LERSA) in Lagos ahead of the governorship election last year, Prof. Osinbajo said: “We have what we call the eligible customer declaration, which is, if you are able to generate power, you can sell your power on a willing-buyer or willing-seller basis”.",
            "“We think that to solve Nigeria’s problem is not to rely on the grid, but to decentralise so that more power companies can produce power where they would sell at a tariff that will not be regulated. At the moment, one of the problems that Discos have is that the tariff is regulated, and it is not cost-reflective. In other words, it is not enough to cover the cost of distributing the power. So, this willing-buyer-willing-seller is one that we think will solve the problems. We believe that the way to go is this willing-buyer, willing-seller for industries, homes etc. ”, he said."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/11/27/ipman-others-back-fg-on-petrol-subsidy-removal-by-2022/",
        "headline": "FIANACIAL ENERGY REVIEW: IPMAN, Others Back FG on Petrol Subsidy Removal by 2022",
        "author": "Posted by:  admin",
        "date": "November 27, 2021",
        "paragraphs": [
            "The Independent Petroleum Marketers Association of Nigeria (IPMAN) has backed the Federal Government’s plan to remove subsidy on Premium Motor Spirit (PMS), also known as petrol by 2021.",
            "IPMAN’s President, Mr Chinedu Okoronkwo, said on Friday in Lagos that the Petroleum Industry Act (PIA) signed into law by President Muhammadu Buhari on Aug. 16 had no provision for subsidy.",
            "The Minister of Finance, Budget and National Planning, Mrs Zainab Ahmed, had announced that the government would remove fuel subsidy and replace it with a monthly N5,000 transport grant to about 40 million poor Nigerians.",
            "Okoronkwo said: “We, as marketers have always advised the government to remove petrol subsidy because it is not in the interest of development of the downstream sector.",
            "“We welcome the decision of the government to stop subsidising petrol by 2022 and we are hoping it will attract more investments to the sector, especially with the passage of PIA.",
            "“What we want is that a level playing field be provided for everyone in the sector to encourage competition once the subsidy is removed.”",
            "He, however, advised the government to reinvest the subsidy savings in critical areas such as healthcare, education, agriculture and other sectors that would increase revenue accruing to the country.",
            "Also, Mr Tunji Oyebanji, immediate-past President, Major Oil Marketers Association of Nigeria (MOMAN), said continued subsidising of petrol was not sustainable in light of current economic realities.",
            "He said the 2022 deadline was realistic and its impact might be mitigated with the coming on stream of the 650,000BPD Dangote Refinery, Bua Group Refinery, Waltersmith Refinery and other modular refineries.",
            "Oyebanji, who is the Managing Director of 11 Plc, however, faulted the plan to replace the subsidy with cash transfer to Nigerians due to lack of a reliable data base in the country.",
            "“In my personal opinion, I am of the view that such funds should be channeled to areas like education and mass transportation that would be accessible to ordinary Nigerians,” Oyebanji said.",
            "An oil and gas expert, Mr Wilson Opuwei, said the conversation about fuel subsidy in Nigeria should have been a thing of the past because it was an obvious wastage of the nation’s resources.",
            "Opuwei, who is the Chief Executive Officer of Dateline Energy Services Limited, maintained that the elites were the major beneficiaries of the fuel subsidy regime.",
            "He said: “We should let market forces determine the price of petrol and other products, not government dolling out subsidies with funds that we don’t even have.",
            "“What government should be doing is to create enabling environment for businesses to thrive, and once Nigerians are economically empowered, we will not be having this debate on petrol subsidy.”"
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/11/30/nlng-chevron-and-exxonmobil-to-reduce-lpg-export-in-favour-of-domestic-market/",
        "headline": "FIANACIAL ENERGY REVIEW: NLNG, Chevron And ExxonMobil To Reduce LPG Export In Favour of Domestic Market",
        "author": "Posted by:  admin",
        "date": "November 30, 2021",
        "paragraphs": [
            "The Federal Government plans to ensure there is a significant reduction in the level of export of Liquefied Petroleum Gas (LPG) otherwise known as cooking gas by multinational oil companies that produce the commodity in the country.",
            "Multinational oil companies such as Nigeria Liquefied Natural Gas(NLNG) Limited NLNG, Exxon Mobil and Chevron according to a government officer are already making efforts to reduce the volume they export to international markets.",
            "Dayo Adeshina, programme manager, National LPG Expansion Plan disclosed this while speaking on Channels Television programme, Sunrise Daily, stating further that a company like NLNG has up its game by moving from 300,000 metric tons to 450,000 metric tons to the local market.",
            "He said that these are some of the things that can be done that would have an immediate effect on the price of the product.",
            "According to him, there are also a couple of other projects that are coming on stream that would enable competition and increasing number of players. “This would bring down the price. So in a short time, the exports are going to be reduced while those volumes would be diverted to domestic market.",
            "He said that about two million households have been impacted as far as the government plans on economic sustainability programme is concerned",
            "Nuhu Yakubu, Chief Executive Officer of Group Banner Gas, in his own comment, said that the current situation and controversies surrounding the price of gas price is unfortunate.",
            "According to him, the introduction of Value Added Tax and import duty by the government is an impediment to the growth of the market, stating that policy inconsistency is a major problem the country has consistently faced.",
            "He said gas retailers are not finding things funny at all as their margins are dropping.",
            "He advocated for the supply of more domestic molecules to address the issue of price in the market.",
            "He said given the right condition, the present situation of gas would be reversed for better.",
            "“The right condition is price, and what would provide the right pricing environment is infrastructure cost.”",
            "He said government imposes unnecessary levies on the market thereby distorting the growth of LPG market. “Gas as a cooking fuel is an essential commodity for Nigerians and should not be target of government taxation, rather it should be seen as an enabler for household wealth creation and also for industrial growth. There is no way the government would generate taxes by taxing the product itself. It is the activities and the commerce that are generated through gas usage that government should tax.”",
            "He said the approach to tax the product is very wrong and in any case. “Nigeria is in a situation where she has massive national security problems in her hands fuelled by desert encroachment, and she is still allowing Nigerians to go back to the forest and cut firewood.”",
            "According to him, VAT is 7.5 percent, import duty is 5 percent but the multiplier effect of this policy reversal is very huge. “There are other obnoxious levies as well that the government has imposed. There are all sorts of agencies levying gas and non-state actors levying gas.",
            "” You go to the terminals to load gas you have associations that have no bearing levying gas operators between N10, 000 to 15,000 per truck.”"
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/12/07/nnpcs-n511-66-billion-remittance-25-percent-of-expected-n2-09-trillion-in-federation-account-in-2021/",
        "headline": "FIANACIAL ENERGY REVIEW: NNPC’s N511.66 Billion Remittance, 25 Percent of Expected N2.09 Trillion in Federation Account in 2021",
        "author": "Posted by:  admin",
        "date": "December 7, 2021",
        "paragraphs": [
            "The Nigerian National Petroleum Company (NNPC) Limited has remitted a total of N511.66 Billion out of the expected N2.09 Trillion into the federation account which is about 25 Percent of expected revenue in 10 months.",
            "An analysis of the figures showed that for the period under review, the sum of N1.581 trillion was recorded as variance between the budgeted amount and actual sum remitted by the company.",
            "The data was part of the national oil company’s November presentation to the Federation Account Allocation Committee (FAAC).",
            "The section of the document tagged, “2021 Monthly Actual NNPC Oil and Gas Revenue and Distribution to FAAC”, indicated that for the entire year, NNPC had projected a total of N2.511 trillion as payment to the three tiers of government. That forecast was largely a mirage, given the severe shortfall posted between January and October.",
            "Whereas the company was supposed to pay N209.30 billion every month into the federation account, the report, which covers its October operations, showed that a paltry N14.85 billion was remitted, representing the least so far released throughout the whole year, apart from April when it remitted nothing.",
            "It wasn’t clear how the authorities augmented the shortfall last month, but in November the three tiers of government shared N671.910 billion as FAAC revenue for the month of October, as against N739 billion the previous month.",
            "However, a release from the Federal Ministry of Finance stated that the amount was inclusive of Value Added Tax (VAT), “augmentations,” exchange gain, and non-oil mineral revenue.",
            "In the month also, the federal government received N284.292 billion, states got N209.838 billion, while the 774 local governments received N156.282 billion.",
            "Oil-producing states received N21.498 billion as 13 per cent derivation of mineral revenues, according to the communiqué released at the end of the meeting.",
            "Under the current sharing arrangement, the federal government takes 52.68 per cent of the revenue shared, states get 26.72 per cent, while the local governments get 20.60 per cent.",
            "Recently, Ekiti State Governor Kayode Fayemi, who is also Chairman of the Nigeria Governors Forum (NGF), lamented that the NNPC had literally not remitted funds into the FAAC in the last four months.",
            "Fayemi added that the failure of the NNPC to remit funds into the federation account was responsible for the decision of his administration, for instance, to slash the subvention of Ekiti State University (EKSU).",
            "A review of the figures released by the NNPC during the November FAAC presentation showed that between January and October, the company was barely able to meet a third of its obligation to the federation.",
            "In January, the national oil company paid N90.8 billion of the N209.3 billion projection; in February it remitted N64.16 billion and in March, the NNPC paid N41.1 billion into the federation account.",
            "But in April, it paid nothing to the three tiers of government; in May it was N38.608 billion; in June it paid N47.16 billion while in July it remitted N67.2 billion.",
            "Things appeared better in August, when NNPC remitted N80 billion to the joint account, but it fell again to N67.533 billion in September, before slumping to N14.85 billion in October.",
            "Although the mandatory cuts imposed by the Organisation of Petroleum Exporting Countries (OPEC) last year initially played a role in the inability of NNPC to meet its obligation to the federation, ageing upstream infrastructure, oil theft and outright sabotage have combined to hobble the country’s oil production.",
            "Nigeria has been unable to meet even the tapered production quota allocated to it by OPEC, thereby further reducing its total crude oil export, coupled with the subsidy payment, which continues to eat deep into the national oil company’s resources.",
            "NNPC will again make a deduction of roughly N200 billion from the joint federal, state and local government account when the FAAC meets later this month to share the statutory monthly allocation.",
            "Analysis of the document detailing the presentation of the national oil company to FAAC in November, indicated that the N200 billion will be the highest amount deducted by NNPC since it resumed payment of petroleum subsidies in February this year.",
            "In all, it further showed that NNPC has removed at least N1.027 trillion from monies accruing to the three tiers of government in the country between February and October as payment for the controversial petrol under-recovery.",
            "A breakdown of the various deductions indicated that payments have increased progressively, growing from N24.3 billion in February, to N60.3 billion in March and N61.9 billion in April this year."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/09/11/npa-expects-18-ships-with-petroleum-products-others-at-lagos-ports/",
        "headline": "FIANACIAL ENERGY REVIEW: NPA Expects 18 Ships with Petroleum Products, Others at Lagos Ports",
        "author": "Posted by:  admin",
        "date": "September 11, 2021",
        "paragraphs": [
            "The Nigerian Ports Authority (NPA) says it is expecting 18 ships laden with petroleum products, food items and others from Sept. 9 to Sept. 16.",
            "NPA made this known in its publication, Shipping Position, a copy of which was made available in Lagos on Thursday.",
            "According to it, the ships are expected to arrive at the Lagos Port Complex.",
            "The publication said that the ships contained general cargo, frozen fish, container, bulk sugar, petrol, bulk gypsum, bulk wheat, bulk malt, empty container, bulk coal and soya oil.",
            "NPA said another eight ships had arrived the ports waiting to berth with petrol, frozen fish, bulk malt, bulk wheat, soda ash and soya.",
            "Also, the organisation said that 23 other ships were at the ports discharging bulk wheat, general cargo",
            "container, frozen fish, bulk fertilizer, base oil, bulk gypsum, automobile gasoline, jet fuel and petrol."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/11/04/chevron-nigeria-appoints-victor-anyaegbudike-as-new-communication-manager/",
        "headline": "FIANACIAL ENERGY REVIEW: Chevron Nigeria Appoints Victor Anyaegbudike As New Communication Manager",
        "author": "Posted by:  admin",
        "date": "November 4, 2021",
        "paragraphs": [
            "Chevron Nigeria Limited (CNL), operator of the NNPC/CNL Joint Venture has announced the appointment of a new Communications Manager in its Policy, Government and Public Affairs Department (PGPA). He is Mr. Victor Anyaegbudike.",
            "Until his appointment, Mr. Anyaegbudike was the External Communications Coordinator for CNL.",
            "Victor holds a Bachelors degree in Mass Communication from Enugu State University of Science and Technology, and a Masters degree in Mass Communication from the University of Nigeria, Nsukka.",
            "He joined Chevron in 2007 as a Field Communications Representative, and has held positions of increasing responsibility in his Chevron career including Senior Communications Representative, Communications Coordinator (PGPA Field Operations) and External Communications Coordinator.",
            "Mr. Anyaegbudike replaces the former Communications Manager, Sola Adebawo, who retired from the company recently."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/11/29/power-generation-falls-by-849-2mw-gencos-blame-consumers/",
        "headline": "FIANACIAL ENERGY REVIEW: Power Generation Falls by 849.2MW, Gencos Blame Consumers",
        "author": "Posted by:  admin",
        "date": "November 29, 2021",
        "paragraphs": [
            "Latest data obtained from the Nigeria power grid shows that electricity generation on the national grid plunged by 849.2 megawatts, as power producers blamed this on the poor utilisation of energy by the system.",
            "A study of the country’s grid performance as posted on Sunday showed that a peak power generation of 4,898MW was recorded on November 26, 2021, but this dropped to 4,048.8MW on November 27.",
            "The data showed that the total energy generated on November 27 was 108,361.39 megawatt-hour, which was lower than the 111,436.31MWh that was recorded the preceding day.",
            "Findings from the latest report on the grid performance indicated that the total energy of 106,802.88MWh that was sent out on November 27, was also lower than the 109,883.01MWh, which was sent out the preceding day.",
            "But power producers blamed the drop in generation to the poor utilisation of generated electricity.",
            "Reacting to claims that the poor supply of electricity was due to lack of generation, the Executive Secretary, Association of Power Generation Companies, Joy Ogaji, said Gencos were not dispatching at full capacity due to the poor utilisation of what they produce.",
            "She said, “There may be many reasons for the ‘seemingly perceived poor or lack of generation. I want to state for the records that no single generation company is allowed, by the system, to send out its available capacity.",
            "“I stand to be corrected with facts not political claims. I repeat! All Gencos are sub-optimally dispatched, with many units idle.”",
            "She argued that capacity utilisation in any market was often used as a measure of productive efficiency and stressed that the average production costs tend to fall as output rises.",
            "“So higher utilisation can reduce unit costs, bringing about a more competitive market which makes plants financially viable,” Ogaji stated.",
            "She added, “The bitter truth is, we are losing generation units due to these games. Do you also know that the wellbeing of the power generation company goes beyond efficient operations to include its ability to generate income from power generated?”",
            "She said the APGC carried out frequency analysis from January to October 2021 and there was no one day that the grid kept to the grid code requirements as contained in Section 15.3.1 of the Grid Code.",
            "The Gencos argued that maintaining a consistent electrical frequency was important because multiple frequencies could not operate alongside each other without damaging equipment.",
            "“But do you know what causes high frequency? It is not low generation but poor utilisation of generation which forces the System Operator to ramp down the Gencos,” Ogaji stated.",
            "In a related development, the Transmission Company of Nigeria on Sunday announced that it would install a new 33kV current transformer and circuit breaker on its 30MVA 132/33kV power transformer in its Suleja 132/33kV transmission substation in Niger State today (Monday).",
            "It, however, stated that the 45MVA, 132/33kV transformer 2 in the same substation would be temporarily interrupted for two hours within the proposed six-hour time frame required to install the new transformer."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/11/26/nmdpra-ngep-partner-on-deepening-domestic-gas-utilisation/",
        "headline": "FIANACIAL ENERGY REVIEW: NMDPRA, NGEP partner on deepening domestic gas utilisation",
        "author": "Posted by:  admin",
        "date": "November 26, 2021",
        "paragraphs": [
            "Downstream Petroleum Authority (NMDPRA), has expressed its willingness to collaborate with the National Gas Expansion Programme (NGEP), to enhance gas production and domestic consumption in the country.",
            "Chief Executive Officer of the Authority, Mr Farouk Ahmed, made this known in Abuja when delegates of the NGEP led by its Chairman, Mr Mohammed Ibrahim paid him a courtesy visit.",
            "Ahmed said the Petroleum Industry Act (PIA) provided opportunities for gas development in Nigeria and NGEP’s efforts in canvassing for gas utilisation and penetration would engender rapid growth in Nigeria’s economy.",
            "He assured the NGEP team that the Authority would put required policies in place to spur growth in the industry that would ensure return on investment, increase production and domestic consumption of Liquefied Petroleum Gas (LPG).",
            "In his remarks, Ibrahim said the gas programme was introduced to make Compressed Natural Gas (CNG) and LPG the fuel of choice for transportation, power generation and domestic purposes.",
            "He said that developing the entire gas value chain would promote gas-based industries especially the petrochemicals like fertiliser and methanol.",
            "According to him, it will enable the support of large industries such as agriculture, industrial applications and textile amongst others.",
            "Ibrahim, however, frowned at the continuous flaring of gas in the country leading to loss of revenue.",
            "According to Ibrahim, If 364 BCF of flared gas is saved, it could generate over 300,000 direct and indirect jobs, 300MW electricity generation in cities and give over 6 million households access to cleanenergy."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/08/21/20-ships-carrying-petroleum-products-others-expected-at-lagos-ports-npa/",
        "headline": "FIANACIAL ENERGY REVIEW: 20 Ships Carrying Petroleum Products, Others Expected at Lagos Ports -NPA",
        "author": "Posted by:  admin",
        "date": "August 21, 2021",
        "paragraphs": [
            "The Nigerian Ports Authority (NPA) has said 20 ships laden with petroleum products, food items and other goods were expected at the Lagos ports from Aug. 19 to 31.",
            "The NPA stated that the ships also contained general cargo, bulk malt, bulk sugar, container, butane gas, jet fuel, automobile gasoline, bulk gypsum, bulk soya bean, bulk wheat and frozen fish.",
            "It also stated that 21 ships were already discharging bulk wheat, general cargo, container, bulk sugar, butane gas, bulk fertilizer,, frozen fish, fuel, soya bean, automobile gasoline, jet fuel and sugar.",
            "The authority added that six other ships had arrived the ports and were waiting to berth with general cargo, base oil, bulk gypsum and petrol."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/10/13/nnpc-engages-ptd-and-narto-pledges-to-rebuild-road-under-tax-under-credit-scheme/",
        "headline": "FIANACIAL ENERGY REVIEW: NNPC  Engages PTD and NARTO Pledges to Rebuild. Road Under Tax Under Credit Scheme",
        "author": "Posted by:  admin",
        "date": "October 13, 2021",
        "paragraphs": [
            "As a follow-up to its efforts in sustaining the current smooth supply and distribution of petroleum products nationwide within the festive period and beyond, the Nigerian National Petroleum Corporation (NNPC) has engaged critical stakeholders so as to find lasting solutions to the road network challenges and other lingering issues.",
            "Also in a bid to calm the nerves of the tankers drivers, NNPC had pledge to Rebuild roads under tax credit scheme",
            "It would be recalled that following NNPC’s intervention over the weekend, the Petroleum Tanker Drivers (PTD)Branch of the Nigeria Union of Petroleum & Natural Gas Workers (NUPENG) called off a planned strike action, agreeing instead to accept the dialogue option proposed by the Corporation, a development that has sustained smooth supply and distribution of petroleum products nationwide.",
            "On Tuesday, 12/10/21, Group Managing Director of the NNPC, Mallam Mele Kyari, took a decisive step towards actualization of his promise when he hosted a major stakeholders’ meeting at the NNPC Towers.",
            "The meeting was attended by the NNPC, the Petroleum Tanker Drivers (PTD), the National Association of Road Transport Owners (NARTO), Department of Petroleum Resources (DPR), Federal Ministry of Works, Federal Inland Revenue Service (FIRS), Department of State Services (DSS), Federal Road Safety Corps (FRSC) and Nigeria Union of Petroleum & Natural Gas Workers (NUPENG).",
            "During the meeting, the NNPC CEO said stakeholders have agreed on a framework for NNPC’s intervention in critical road rehabilitation through the Federal Government Tax Credit Scheme.",
            "“We are committed to utilising the Federal Government’s Tax Credit Scheme to rebuild some of the affected roads in line with Mr. President’s Executive Order 7. Upon our fruitful deliberations today, the NNPC has pledged to support the PTD and NARTO in carrying out quick intervention fixes on some strategic bad spots identified to enable unhindered movement of trucks for transportation of petroleum products nationwide,” Mallam Kyari stated.",
            "Established under FG’s Executive Order 7 of 2019, the Road Trust Fund Policy/Tax Credit Scheme gives private sector operators an opportunity to fund critical infrastructure with the government.",
            "Stakeholders also agreed to enforce mandatory installation of safety valves in all petroleum product trucks in the country effective February 1, 2022 with full commitment given by NARTO.",
            "The meeting also frowned at the abuse of axle load or tonnage limits, with the NNPC agreeing to engage the Nigerian Customs Service for enforcement of preventing the importation of tanks that exceed 45,000 litres capacity."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/12/01/nlpga-seeks-end-to-cooking-gas-pricing-value-chain-crisis/",
        "headline": "FIANACIAL ENERGY REVIEW: NLPGA, Seeks End to Cooking Gas Pricing, Value-Chain Crisis",
        "author": "Posted by:  admin",
        "date": "December 1, 2021",
        "paragraphs": [
            "To avoid a decline in domestic gas utilisation as a result of various challenges in the value chain, operators in the gas value chain, under the aegis of the Nigeria Liquefied Petroleum Gas Association (NLPGA), are engaging with the agencies of the Federal Government to find ways of addressing pricing issues as it relates to Liquefied Petroleum Gas (LPG), otherwise known as cooking gas.",
            "The President of NLPGA, Nuhu Yakubu, during the association’s 11th International Conference and Exhibition, held in Lagos with the theme: “Market Growth and Fiscal Regulations -Rethinking the LPG Supply Gaps Amid the Challenging Regulatory Environment,” noted that the business environment needs to be friendly for everyone.",
            "“As an association, we are currently engaging with respective government agencies in addressing issues around LPG supply, particularly access to foreign exchange, value-added tax, levies, etc. We believe our efforts will yield positive results in a good time,” Yakubu said.",
            "He added that sustaining the growing adoption of LPG through sector-friendly policies and programmes would support economic growth that would yield jobs and wealth creation, explaining that it was the collective responsibility of all stakeholders in the LPG sub-sector to make it happen.",
            "He said that in line with the seventh item in the Sustainable Development Goals (SDGs), deepening education on the role of diverse applicable uses of LPG was critical as the world aims to provide cleaner, reliable, sustainable and affordable energy sources for everyone by 2030.",
            "According to him, worthy of mention is the declaration of the “Decade of Gas” by the Minister of State for Petroleum Resources, Mr. Timipre Sylva, with the support of President Muhammadu Buhari, which he said was a worthy policy action.",
            "In a communiqué issued at the end of the event, experts noted that Nigeria has very huge gas reserves of over 200 trillion standard cubic feet (tscf) but that the current business environment has not been friendly.",
            "Consequently, the NLPGA urged the Federal Government to create an enabling environment capable of attracting and retaining massive investments into the LPG sector.",
            "The organisation said that the Petroleum Industry Act (PIA) should be implemented in a manner that will encourage massive domestic and foreign direct investments required to stimulate sustainable growth while creating many multiplier effects, including jobs for Nigerians.",
            "It added: “That such new investments are required to reduce Nigeria’s current dependence on imported LPG as well as meet rising future demand based on increased population. That the government should be consistent in the conceptualisation and implementation of policies needed to ensure stability in the LPG sector.",
            "“That relevant stakeholders need to be involved and carried along in the process of taking new decisions to ensure successful implementation of PIA. That the imposition of the 7.5 per cent Value Added Tax (VAT) has negatively affected the sector in many unintended ways and should be eliminated.",
            "“That the high prices of LPG have shifted the demand to firewood and charcoal, thus fuelling desertification and erosion with a very negative impact on the environment. That a package of new incentives should be introduced to stimulate investment, processing and utilisation of LPG in Nigeria in line with the nation’s Decade of Gas agenda.”"
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/12/06/lekoil-nigeria-makes-offer-to-acquire-lekoil-caymans-shares-days-to-agm-%e2%80%8b/",
        "headline": "FIANACIAL ENERGY REVIEW: Lekoil Nigeria Makes Offer To Acquire Lekoil Cayman’s Shares Days to AGM ​",
        "author": "Posted by:  admin",
        "date": "December 6, 2021",
        "paragraphs": [
            "Lekoil Nigeria Limited has written to the shareholders of Lekoil Limited (Lekoil Cayman) with an “indicative offer to acquire Lekoil Limited shares and potential share exchange.”",
            "Desspite similarity in their names, the two firms are engaged in a face-off, which began with the convening of an Extraordinary General Meeting (EGM) at the instance of Lekoil Cayman Board constituted after Metallon Corporation acquired some shares in the company in a takeover attempt.",
            "The letter written to Lekoil Cayman on Friday, December 3, 2021, according to a statement, showed that it is a precursor to the Lekoil Limited Annual General Meeting (AGM) scheduled to hold this December according to the notice of the AGM dated November 26, 2021.",
            "The letter signed by Aisha Oyebode, Chairman, Lekoil Nigeria Limited, noted among others that the Lekoil Limited shareholders “stand to suffer over a 40% dilution” of their shareholding to merely fund the salaries and costs of the Board of Lekoil Limited if they failed to vote against the resolutions at the forthcoming Lekoil Cayman AGM.",
            "It will be recalled that the face-off between the two companies began with the convening of an Extraordinary General Meeting (EGM) at the instance of Lekoil Cayman Board constituted after Metallon Corporation acquired some shares in the company in a takeover attempt.",
            "Shortly after that acquisition, Lekoil Cayman voted to remove its CEO and founder, Lekan Akinyanmi, (who remains the CEO of Lekoil Nigeria) on the grounds of corporate governance breach.",
            "That action led to a number of high-profile resignations from the Board of Lekoil Cayman including the Chief Financial Officer (CFO), Ed During who left his position, indicating his inability to continue with a management team demonstrating uncommon disregard for the opinions of the CFO, as well as an inclination to mislead regulators.",
            "In the light of the foregoing, Lekoil Nigeria said in the letter that it is offering to acquire Lekoil Limited shareholders’ “shares at a premium of 100 percent to the last trading price shares” prior to the Lekoil Limited suspension from trading or to acquire the “shares in exchange for the issuance of new shares in Lekoil Nigeria”.",
            "The Nigerian oil firm has also promised to return to shareholders with a detailed offer on or before December 14, 2021.",
            "Oyebode registered her displeasure in the letter which reads in part; “As fellow Shareholders, the board of directors of Lekoil Nigeria Limited (Lekoil Nigeria) received the AGM Notice and no doubt experienced the same dismay and disappointment as experienced by the many Shareholders who have been in touch with us.",
            "“The same board of directors of Lekoil Limited and activist Shareholders that asked you to place your trust in them and promised you improved corporate governance has displayed a pitiful disregard for corporate governance and a singular determination to steal your company. The board of Lekoil Nigeria believes that Shareholders deserve an alternative option to that presented by the board of Lekoil Limited in the AGM Notice”",
            "Aside citing gross breach of corporate governance and alleged move by the Board of Lekoil Limited to “steal” Lekoil Nigeria assets from the shareholders, Lekoil Nigeria further alleges that, corporate governance has reached abysmal levels under the stewardship of Executive Chairman, Anthony Hawkins.",
            "“Mr Hawkins has clearly shown that he is not representing the interests of Shareholders as a whole, but that of a clique of Shareholders who have taken control of your company and whose behaviour since then has confirmed their sole intent was to gain outright control of the assets of Lekoil Nigeria.”",
            "Lekoil Cayman Limited was suspended from trading the company’s Ordinary Shares on the Alternative Investment Market (AIM) under Rule 19 and 40 with effect from October 1, 2021.",
            "The admission to trading of the shares of Lekoil Limited has been suspended for over sixty (60) days leaving Shareholders in an illiquid investment and a company without regulatory oversight of AIM Regulation and the London Stock Exchange."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/11/25/nlc-rejects-planned-petrol-price-increase/",
        "headline": "FIANACIAL ENERGY REVIEW: NLC Rejects Planned Petrol Price Increase",
        "author": "Posted by:  admin",
        "date": "November 25, 2021",
        "paragraphs": [
            "The Nigeria Labour Congress (NLC) has called on the Federal Government to consider options to help the country embrace developmental governance and accountable leadership while rejecting the planned petroleum price increase.",
            "NLC President, Comrade Ayuba Wabba, made the call in a statement issued on Thursday and titled: ”Nigerian workers refused to take the bait’’.",
            "According to him, the Group Managing Director, Nigerian National Petroleum Corporation (NNPC), Malam Mele Kyari, announced that petrol could cost as much as N340 from February 2022.",
            "Wabba described as “comical“ the bait by the government to pay 40 million Nigerians N5,000 as palliative, to cushion the effect of the astronomical increase in the price of petrol.",
            "He said that the total amount involved in what he called “queer initiative“ was far more than the money government claimed to spend currently on fuel subsidy.",
            "“The NNPC GMD said that the price increase would be consequent on the plans by the Federal Government to remove subsidy on Premium Motor Spirit, also commonly referred to as petrol or fuel.",
            "“The grand optimism of the NNPC GMD was predicated on the claims that the removal of fuel subsidy is now backed by an act of parliament probably the Petroleum Industry Act which was recently signed into law,’’ he said.",
            "Wabba noted that the Minister of Finance, Budget and National Planning, Mrs Zainab Ahmed, re-echoed same on Tuesday at the launch of the World Bank’s Nigeria Development Update (NDU).",
            "He added that the minister announced government’s plans to disburse N5000 to 40 million poorest Nigerians each as a transport grant to cushion the effect of the planned removal of the fuel subsidy.",
            "Wabba said the disclosures by NNPC GMD and the Minister were in symphony with the positions of the World Bank and the International Monetary Fund (IMF) which urged the Federal Government to do away with fuel subsidy.",
            "“The response of the NLC is that what we are hearing is the conversation of the Federal government with neo-liberal international monetary institutions.",
            "“The conversation between the government and the people of Nigeria, especially workers under the auspices of the trade union movement on the matter of fuel subsidy was adjourned sine die so many months ago.",
            "“Given the nationwide panic that has trailed the disclosure of the monologue within the corridors of government and foreign interests, the NLC wishes to maintain its rejection of deregulation based on import-driven model.",
            "“We wish to reiterate our persuasion that the only benefit of deregulation based on import driven model is that Nigerian consumers will infinitely continue to pay high prices for refined petroleum products.",
            "“This situation will definitely be compounded by the astronomical devaluation of the naira which currently goes for N560 to one US dollar in the parallel market, ’’he said.",
            "The NLC president said that any attempt to compare the price of petrol in Nigeria to other countries would be set on a faulty premise as it would be akin to comparing apples and mangoes.",
            "Wabba said the contemplation by the government to increase the price of petrol by more than 200 per cent was a perfect recipe for an aggravated pile of hyperinflation and an astronomical increase in the price of goods and services.",
            "According to him, this will open a wide door to social consequences such as degeneration of the current insecurity crises. nan."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/12/08/fcmb-proparco-sign-35-million-funding-deal-for-renewable-energy-projects/",
        "headline": "FIANACIAL ENERGY REVIEW: FCMB, Proparco Sign $35  Million Funding Deal for Renewable Energy Projects",
        "author": "Posted by:  admin",
        "date": "December 8, 2021",
        "paragraphs": [
            "First City Monument Bank, FCMB, has signed a $35 million loan and an EURIZ portfolio guarantee of N5 billion (EUR 10 million equivalent) deal with Proparco.",
            "The credit line will fund renewable energy projects and Small and Medium Scale Enterprises, SMEs, affected by the Covid-19 pandemic.",
            "Speaking at an agreement signing ceremony in Lagos on December 1, 2021, the Managing Director of FCMB, Yemisi Edun, said: “Proparco’s financing and risk-sharing interventions align with our purpose, commitment and support to SMEs with high growth potential and the renewable energy sector. We are optimistic that this partnership will accelerate the development of industries critical to attaining sustainable and inclusive economic growth in Nigeria.",
            "Also speaking, the Country Director of Proparco, Jean Guyonnet-Duperat, said: “We are excited to partner with FCMB again in our commitment to promote sustainable economic, social and environmental development. Through our collaboration with FCMB and its wide network, we are optimistic about making more impact in facilitating the growth of local economic players to overcome the challenges of the COVID-19 crisis. Furthermore, this boosts the private sector contribution towards the achievement of Sustainable Development Goals.”",
            "On her part, the Minister Counsellor/Head of Co-operation, European Union, Ms Celine Tassin-Pelzer, stated that: “The European Union recognises the importance of SMEs, particularly women-owned ones, to the growth of societies. We will continue to offer support in critical sectors to create opportunities for individuals and businesses to thrive and overcome their challenges. We are proud to support the laudable activities of FCMB to achieve these objectives”.",
            "FCMB Group Plc, led by the Group Chief Executive, Ladi Balogun, is a purpose beyond profit business. First City Monument Bank and its subsidiaries are committed to creating financial products and services that solve social problems at scale."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/11/23/ikeja-electric-advocates-sanctions-against-activities-under-power-lines/",
        "headline": "FIANACIAL ENERGY REVIEW: Ikeja Electric Advocates Sanctions Against Activities Under Power Lines",
        "author": "Posted by:  admin",
        "date": "November 23, 2021",
        "paragraphs": [
            "…Invests over N200m on safety equipment in last one year…….",
            "Ikeja Electric Plc (IE), Nigeria’s largest electricity Distribution Company has cautioned members of the public to desist from erecting structures under power lines or carrying out activities and trading near electrical installation, which in effect exposes them to risk of electrocution.The DisCo noted that proximity to installations such as transformer, electric poles or power lines contravenes the extant law, therefore people in such locations should vacate those areas urgently in order to protect their lives and property.According to the Head of Quality, Health, Safety & Environment (QHSE) for Ikeja Electric (IE), Engr. Jamiu Badmos, the warning became necessary because it has been observed that such acts are perpetrated with impunity irrespective of the dangers associated with such violations. He also noted that Ikeja Electric in line with its Quality, Health, Safety and Environment (QHSE) policy consistently sensitizes customers on the dangers of trading and building near, around or under power lines.He also disclosed that the company has spent over N200m in the last one year on the purchase of different types of Personal Protective Equipment (PPE) as well as organizing interactive occupational health and safety training for employees, whilst also reiterating the company’s commitment to entrench a value driven safety culture that goes over and beyond safety requirements to build a world class safety conscious environment.Speaking on the defiance of the law guiding proximity to power installations, Badmos said that Section 3.1 of the Nigerian Electricity Supply and Installation Standards (NESIS) Regulation 2015 stipulates a mandatory distance of 5.5 meters, 15 meters and 25 meters setback from 33/11kV, 132kV and 330kV lines respectively. However, some members of the public have continued to violate the law, making them vulnerable to the risk of unfortunate incidents, which sometimes result in fatalities.“As a responsible and safety conscious organization, safety enlightenment is top priority and we constantly sensitize members of the public on the dangers of improper handling of electrical issues through our Public Safety Sensitization Programme (PSSP). This presents the opportunity to articulate the required safety measures such as appropriate rating of materials, proper installation and maintenance of earthing on buildings, curbing illegal technicians and vandalization of network infrastructure, dangers of building and trading under powerlines,” he explained.The DisCo recently embarked on a SafeAware initiative at all Customer Service touchpoints and other strategic locations across the Business network in an effort to embed attitudinal change to safety practices amongst staff and customers.To ensure compliance with the safety standard, Badmos called on “the Federal and State Government as a matter of urgency, to harmonize efforts to find a lasting solution to this issue by wielding the big stick on defaulters while DisCos continue to sensitize customers on the inherent dangers associated with continued violation of safety practices.”Ikeja Electric remains committed to raising the bar on safety standards in the Power Sector with the safety and well-being of Customers, and will continue to uphold this as top priority"
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/12/04/nuprc-reiterates-commitment-to-tackle-oil-spills/",
        "headline": "FIANACIAL ENERGY REVIEW: NUPRC Reiterates Commitment to Tackle Oil Spills",
        "author": "Posted by:  admin",
        "date": "December 4, 2021",
        "paragraphs": [
            "",
            "",
            "",
            "",
            "By Engr. Gbenga Komolefe, NUPRC CEO",
            "The Nigerian Upstream Petroleum Regulatory Commission (NUPRC) has reiterated its commitment to tackle oil spills in the Nigerian oil and gas sector in fulfillment of its regulatory mandate as enshrined in the Petroleum Industry Act (PIA) 2021, Petroleum Act and the Petroleum (Drilling and Production) Regulations and subsidiary legislations.",
            "This assurance has become necessary following concerns trailing the oil spill incident of November 3, 2021 which occurred at the Santa Barbara Well 1 operated by AITEO Eastern Exploration and Production Company in Bassambiri, Nembe Local Government Area of Bayelsa State.",
            "The Commission will continue to monitor the site situation and guide the operator until the spill and its attendant problems are completely addressed. This includes but is not limited to implementing all effective physical and engineering solutions to the incident, managing the safety of the response providers and people in the neighbouring communities and educating the general public on the site situation periodically.",
            "In specific terms, the Commission will ensure that the pressure from the well is stopped to put an end to the oil release, the already released oil is appropriately contained and skimmed off as it is being released, a joint investigation visit (JIV) is conducted as soon as it is safe to do so, cleanup and restorative actions are done immediately after the spill is stopped and compensation paid to affected communities timeously and in accordance with the law.",
            "We appreciate the concerns raised in different quarters following the incident and wish to inform the general public and our stakeholders that the Commission has taken all necessary steps alongside the relevant stakeholders to ensure that the situation does not degenerate further.",
            "It was confirmed that upon receiving the report of the incident, the operator, AITEO mobilized immediately for preliminary assessment of site conditions and based on the specific site requirements, positioned containment booms to isolate the spill source and prevent oil from spreading further; while also cordoning off the area to prevent injuries to people and fire from any possible ignition source.",
            "It also called in Boots and Coots, a well disaster management company, from the US, to cap the pressure and stop further spill. Clean Nigeria Associates (CNA) was also engaged to contain and recover the oil as well as manage and protect the immediate environment. The company has continually updated the NUPRC on site conditions and their action steps.",
            "On receipt of reports of the incident by the Commission, our field operations team were promptly mobilised and are currently on ground for regulatory oversight assessment to determine probable cause(s) and to ensure all response actions are the most appropriate and effective to return normalcy in the shortest possible time.",
            "Apart from checking to confirm that the company is carrying out the necessary response measures to contain the situation, the Commission has made its officials available to participate in containment procedures that are considered safe by the experts at this moment. Initial spill report has been received and appropriately reviewed and documented while updates are received diligently.",
            "When the incident occurred, the Honourable Minister of State for Petroleum Resources and the Commission’s Chief Executive visited communities around the spill site to brief them of safety measures already put in place as well as assure them of the commitment of the Commission to sort out the situation in the shortest possible time. Relevant and verified information about the development are also being released routinely to the public to avoid misinformation.",
            "In line with our statutory responsibility, operations at the site is under the supervision of the Commission and efforts are on-going to contain the spill, stop the flow, control and clean-up the spill.",
            "Our preliminary investigations have revealed that there were no fatalities in the incident. However crude oil and gas were seen gushing out from valves close to the top of the wellhead at high pressure but without any associated fire. The water surrounding the wellhead was polluted with oil. The affected well had been previously shut-in and therefore not producing at the time of incident.",
            "While the incident is to be treated with care and the location approached with caution by only those authorized to do so, the Commission wishes to reiterate that there is no cause for panic. This is because on a routine basis and under the supervision of relevant teams from the Commission, all petroleum companies are mandated to conduct drill exercises to adequately prepare for all eventualities.",
            "Under this arrangement, such companies are required to document all necessary response actions in their Oil Spill Contingency Plan which is routinely and painstakingly reviewed by the Commission; and which is to be activated for response in emergency situations. Details of the regulatory requirements are contained in the PIA 2021 and further enunciated in the EGASPIN 2018. These form the basis of our strategic focus to achieve zero incidences going forward.",
            "As part of our strategic plans for incident management, the operators have been mandated to activate Environmental Management Plans (EMP) which includes Environmental Compliance Monitoring (ECM) among other response actions. At the end of the clean-up exercise, the Commission will supervise all the operators to conduct Post Impact Assessment (PIA) studies to determine the far-reaching effects of the spills, with a view to restoring all impacted environment as near as possible to their pristine state.",
            "The general public and all stakeholders are hereby assured that the Commission is taking every necessary action to ensure that the spills and associated incidents have the least impact on the affected communities and the environment."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/11/19/totalenergies-appoints-rufai-sirajo-as-acting-chairman-as-stanislas-mittelman-steps-down/",
        "headline": "FIANACIAL ENERGY REVIEW: TotalEnergies Appoints Rufa’i Sirajo as Acting Chairman, as Stanislas Mittelman Steps down",
        "author": "Posted by:  admin",
        "date": "November 19, 2021",
        "paragraphs": [
            "The Board of Directors of TotalEnergies Marketing Nigeria Plc. has announced the appointment of Engr. Rufa’i Sirajo as the new Acting Chairman of the company, following the resignation of Mr. Stanislas Mittelman.",
            "According to a notice signed by the Company’s Secretary, Bunmi Popoola-Mordi, and made available on the website of the Nigerian Exchange Limited (NGX), Engr. Sirajo will assume the position of Acting Chairman pending the next meeting of the Board of Directors when a new Chairman will be appointed.",
            "The statement recently issued by the energy giant reads: ‘’We write to formally notify the investing public and the Nigerian Exchange Limited that Mr. Stanislas Mittelman has resigned from the Board of TotalEnergies SE with immediate effect, and so he ceases to be the Chairman of the Board of TotalEnergies Marketing Nigeria Plc.",
            "‘’Engr. Rufa’i Sirajo will assume the position of Acting Chairman pending the next meeting of the Board of Directors when a new Chairman will be appointed.’’",
            "Recall that Mr. Stanislas Mittleman was appointed as Chairman of the defunct Total Nigeria Plc. (now TotaEnergies Marketing Nigeria Plc.) on the 12th of August 2016.",
            "About Engr. SirajoEngr. Ahmed Rufa’i Sirajo is currently the Managing Director/Chief Executive Officer of Nalado Nigeria Limited. He started his working career in 1986 as Engineering Superintendent (Electrical) at Geotechnical Services Limited, from where he later moved to NOCACO as Quality Control Supervisor.",
            "Sirajo obtained a National Diploma in Electrical/Electronic Engineering from the Federal Polytechnic Mubi, a Higher National Diploma in Electronics/Telecommunications Engineering from Kaduna Polytechnic, Post Graduate Diploma in Electrical Engineering from Bayero University, Kano and an MBA degree from the University of Calabar.",
            "He is registered with the Council for the Regulation of Engineering in Nigeria (COREN), Member of the Society of Engineers (MNSE), and also a Member of the Solar Energy Association of Nigeria."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/11/14/fuel-subsidy-40-dormant-refinery-licenses-threaten-planned-removal-in-2022/",
        "headline": "FIANACIAL ENERGY REVIEW: Fuel Subsidy: 40 Dormant Refinery Licenses Threaten Planned Removal in 2022",
        "author": "Posted by:  admin",
        "date": "November 14, 2021",
        "paragraphs": [
            "The planned withdrawal of fuel subsidy by the Federal Government by the end of the first half of 2022 is currently generating heated arguments among Nigerians and stakeholders alike.",
            "While the World Bank has decried the continued spending by the Nigerian government on petrol subsidy, which it said is on track to gulp up to N2.9 trillion this year, the claims by the Nigerian National Petroleum Corporation (NNPC) that the country consumes over 60 million litres of fuel daily has been faulted by stakeholders.",
            "According to an exclusive report by Daily Sun in June 2021, the huge subsidy figure is further compounded by the possession of 40 dormant refinery licenses by oil firms.",
            "Citing documents from the defunct Department of Petroleum Resources (DPR) now Nigerian Upstream Petroleum Regulatory Commission (NUPRC), it was revealed that the dormant refinery licenses dipped Nigerian refining capacity by 1,862,000 million barrels per day (bpd).",
            "The DPR refinery license status report indicated that as at May 2021, a total of 68 refineries license and approval had been granted, out of which 40 are inactive.",
            "Minister of Finance, Budget and National Planning, Zainab Ahmed, had during a panel session at the 27th Nigerian Economic Summit (NES#27) in October in Abuja. said that full deregulation of the of the downstream oil and gas sector would start by July 2022.",
            "Though industry observers are in doubt of the full implementation of deregulation as the Federal Government had on several occasions claimed to have exited the subsidy regime, only to re-introduce the same when prices of crude oil begin to surge.",
            "Ahmed said that the Federal Government would only cater for subsidy on petrol in the first six months of 2022.",
            "In seven months, petrol subsidy payments gulped N714 billion, shrinking monthly revenue accrued to the federation account.",
            "The Nigerian National Petroleum Corporation (NNPC), which is currently the sole importer of petrol, has been deducting subsidy payments from oil and gas proceeds due to the three tiers of government since there is no provision for it in the 2021 budget.",
            "“In our 2022 budget, we only factored in subsidy for the first half of the year; the second half of the year, we are looking at complete deregulation of the sector, saving foreign exchange and potentially earning more from the oil and gas industry,” she said.",
            "But a management consultant/oil and gas policy advisor, Mr Micheal Faniran, said that the continued payment of fuel subsidy is a violation of the Petroleum Industry Act, adding that the president was not complying with the provisions of the Act and could be sued for that breach.",
            "He said the money being spent on fuel subsidy for several years could have been channeled to infrastructural development that would impact positively on the living conditions of Nigerians.",
            "‘‘Currently, the price of crude oil is over $80 per barrel which ordinarily should be good news for Nigerians, but the reverse is the case because the larger chunk of the country’s oil revenue is again ploughed back to subsidy which comes through petrol imports as a result of the comatose state of the refineries,’’ he pointed out.",
            "He admitted that the immediate impact of withdrawal of fuel subsidy will translate to higher cost of fuel, assuring that as more players come into the market through healthy competition the prices would drop.",
            "Faniran cited the case of the telecoms sector, saying at inception, only fewer Nigerians could afford to purchase the SIM card, but that today, SIM cards are even given out for free and in the cases where they are sold, it comes at a paltry sum.",
            "He argued that the continued payment of fuel subsidy was not sustainable as the country’s debt services to revenue ratio are poles apart.",
            "On his part, the Partner, Bloomfield Law Practice, Dr Ayodele Oni, said that he always felt that subsidy was a bad idea in the long term, for the electricity and downstream petroleum sectors.",
            "Subsidy, according to him, encourages corruption and inefficiency in the two sectors which should thrive only on efficiency.",
            "“Further, government revenues cannot continue to sustain subsidy. What should be done instead is to reduce the need for petroleum products by ensuring the power sector works as many people will substantially reduce their need to buy petroleum products if the electric power sector works.",
            "“Rather than have subsidy, government should set up well run social programmes for the most vulnerable and the poorest people as is done elsewhere. We need records, honesty and competence in public service and politics to achieve those.",
            "“We also require strong institutions. If the electric power and transportation sectors work, reliance on petroleum products will reduce substantially. Then the debate around subsidy will weaken tremendously.",
            "“Government should get to work and create a more enabling environment for the transportation and electric power sectors to work. Government needs to do much more in terms of policy, regulation, attractiveness and enforcement for things to work,’’ he advised.",
            "But the President of the Petroleum and Natural Gas Senior Staff Association of Nigeria (PENGASSAN), Mr Festus Osifo, said that it would not support the Federal Government’s full deregulation of the downstream sector of the petroleum industry except domestic refining of petroleum products is guaranteed.",
            "He insisted that the union would only support the deregulation of the downstream if the government is ready to develop local production capacity by rehabilitating the refineries.",
            "PENGASSEN, he said, used to be a strong supporter of deregulation until the Federal Government began to fail in its promises, resulting in what he described as ‘trust deficit’.",
            "He said: “We have spoken a lot about the advantages of deregulation, but have not talked about its disadvantages.",
            "“There is no system in the world where you have a policy direction that has advantages without disadvantages.",
            "“We have seen societies grow without capitalism, for example, China. It will be very difficult for government to transfer its inefficiency to the masses.",
            "“If the refineries are working, I don’t think Labour would have opposed government’s plans to deregulate.”",
            "Using the power sector as a case study, Mr Isifo explained that the way and manner the government had implemented deregulation in the power sector, has made the masses lose confidence in them and doubt the sincerity in its current plans to deregulate the petroleum downstream.",
            "“Our position before was that government should deregulate, but fix the refineries.",
            "“What Labour is saying today is that government should fix the refineries. If they are working, we will support deregulation.",
            "“We were in this country when power was privatized. After privatization, the GenCos and DisCos were sold to friends of the government. They used the tax payers’ money to fund them.",
            "“When things later were not going well and they started complaining, government again used the tax payers’ money to solve their problems.",
            "“So, there’s the issue of trust deficit. Trust deficit is the greatest problem in this system.",
            "“So, for us Labour, we are supporting deregulation, but the deregulation must be based on local production,” he noted.",
            "However, the immediate past Chairman of Major Oil Marketers Association of Nigeria (MOMAN),Mr Tunji Oyebanji, noted that labour has been one of the major challenges to the attainment of planned deregulation.",
            "Oyebanji who is the Managing Director/CEO at 11 PLC formerly Mobil Oil Plc, said that labour is not sure whether the government will consider the interests of the masses when it removes subsidy on petrol.",
            "“There has been resistance from Labour which is fighting for the interest of the masses. And I understand their position.",
            "“They are concerned about the inadequacy in local production capacity that has led to all of our products being imported.",
            "“For Labour, there has always been a great concern about what happens with the subsidy.",
            "“Once we stop paying subsidy, will the money recovered now be used in the interest of the common man?",
            "“For the investors, when price is fixed, it discourages investment. Investments won’t come because people are not certain about prices,” Oyebanji said.",
            "On downstream deregulation, he said, “NNPC remains the major importer of gasoline in Nigeria.",
            "“We have heard a lot of pronouncements about deregulation. No access to foreign exchange for private importers.",
            "“There is poor infrastructure in the downstream. There’s a lot happening outside Nigeria that we cannot fully apply here because of our margins.",
            "“But we need to change the petroleum landscape by growing and developing the infrastructure, and by that, make Nigeria a hub for investments.",
            "“There’s need for a balance between sustainability and the provision of value to Nigerians and the Nigeria economy.",
            "“Deregulation will allow the market determine the prices itself.",
            "“If Nigeria deregulates, it will not only become a net exporter of gas, but it will also be able to employ a lot of its teeming unemployed youths roaming the streets today,” he said.",
            "He further explained that Nigeria would become a net exporter of gas if it can maximize the opportunities presented by the new PIA (Petroleum Industry Act) to deregulate the petroleum downstream, especially its pricing system.",
            "Oyebanji strongly condemned subsidizing petroleum through borrowing, and therefore, asked for its removal.",
            "“Our industry is very volatile. So, the need for deregulation is very imperative.",
            "“It is better to have a situation where prices are responding to the market forces.",
            "“You won’t even notice the daily changes. That’s the difference with having the market determine the price versus the government regulating the price.",
            "“Hopefully, with the PIA and the encouragement coming, we will see more improvements in the sector which will help us become a net exporter as far as gas is concerned.",
            "“There’s an argument for deregulation, and by extension, the removal of subsidy.",
            "“Deregulation is aimed at improving business operations and removing regulated pricing system which would result in the growth of the oil and gas industry.",
            "“It requires a strong regulator to enable a fair and effective price system in the industry.",
            "“Borrowing to pay subsidy is not sustainable,” he said.",
            "Source- Sun News."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/11/29/pengassan-all-on-axxela-suggest-how-nigeria-can-achieve-full-deregulation-and-key-into-energy-transition/",
        "headline": "FIANACIAL ENERGY REVIEW: PENGASSAN, All ON, Axxela Suggest How Nigeria can Achieve Full Deregulation and Key into Energy Transition.",
        "author": "Posted by:  admin",
        "date": "November 29, 2021",
        "paragraphs": [
            "Stakeholders in the energy sector have suggested ways Nigeria can achieve full deregulation in the course of the current energy transition being experienced globally.",
            "They also urged Nigeria not to waste time in keying into the energy transition early enough, stating that the benefits are enormous.",
            "The subsidy that is put into petrol they said should be diverted to renewable while also advocating for full deregulation of the power sector.",
            "The deregulation of the downstream of the Petroleum industry they said should be based on local production so that the economy can move in the direction it should go.",
            "The stakeholders who spoke at a panel of discussants at the 2021 NAEC Strategic International Annual Conference with a theme, PIA: Energy Transition And the Future of Nigeria’s Oil and Gas Stated their own views about the energy transition as it relates to the oil and gas sector of the economy.",
            "Olufisayo Duduyemi, chief strategy officer Axxela Limited, in his comment, said in the context of the energy transition, it is acknowledged that there would be a significant reduction in the use of fossil fuel in the years ahead and urged Nigeria to switch over to natural gas as a fuel of choice.",
            "He stated that it is through the usage of natural gas that Nigerians can experience some soft landing from the effects and impact of full deregulation of the downstream sector of the oil and gas industry.",
            "The Axxela chief strategy officer advised that the country’s gas resources should be harnessed and monetized.",
            "“Let us put gas into our process and industries. By so doing cost of production would reduce, the cost of commodities would drastically reduce and would become more available to the masses, this is the role natural gas is playing now and the future,” he said.",
            "In his contribution on having a smooth landing as regards deregulations, Wiebe Boer, Chief executive officer of All On an investment company that is investing in renewable in Nigeria and funded by Shell, said renewable energy is the future of energy",
            "According to him, if we spend so much time as a country figuring out this problem on an industry that is currently losing momentum or becoming outdated in the world, he fears that we would be left behind in the energy transition as well.",
            "He the government has tried bypassing the Petroleum Industry Act ( PIA ) which means there would be full deregulation in the downstream sector of the Petroleum Sector. He also advocated for total deregulation also in the power sector so that the economy can just move in the direction it should move.",
            "He said there is a lot of interested parties are coming into the market and this is a big opportunity for Nigeria.",
            "He stated that some downstream companies with petrol stations are thinking of transforming those petrol stations from just selling petrol to providing services in areas such as renewable so that Nigeria can key in into the drive of renewable.",
            "On how a just transition can be ensured in the country, he said, we should just take the petrol subsidies away and invest in renewable energy, especially solar, wind and a few others so that any village or anybody in Nigeria can have access to electricity.",
            "Festus Osifo, President of Petroleum and Natural Gas Association of Nigeria (PENGASSAN) said while organized labour is not opposed to deregulations, it is difficult for the government to transfer its inefficiencies to the masses. He said what has happened over the years is that we have governments that are just inefficient.",
            "According to him, it is that inefficiency that is making our refineries not to work today. “if the refineries were working I don’t think that the labour organizations would oppose deregulation”. He said since the mid-1990s the direction of labour has been government, why not fix the refineries. So that the foreign component that goes into the costing would be eliminated.",
            "Just imagine today, people working in refineries are Nigerians, you will pay them in Naira. So when you are, when the dollar is appreciated against the Naira, at the end of the day, the manpower is stabilized. The cost of labour is in Naira and not in dollars. So the only thing you now price in the dollar is the cost of crude oil.”",
            "He said what the organized labour told the government is that fix the refineries, when the refineries are working we would support you to deregulate, that what they don’t want is import drive deregulation. But it should be based on local production.",
            "He said that there has been trust deficit that has existed between the government and the people over the years.",
            "If the privatization of the power sector has been done in Germany, or South Africa, it would have been successful, but since they sold them to their friends the exercise has been a failure. And after selling the Gencos and Discos to their friends they ended up lending them the taxpayer’s money to run this enterprise. Which were grossly undervalued?”",
            "He said they are supporting deregulation but it must be based on local production.",
            "Adeola Yusuf of Platform Africa said lack of trust has been the reason why the people are not supporting Government. He said the government has been talking to people and not communicating with the people. Because the government is not communicating with the people."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/12/13/aiteo-intensifying-clean-up-of-nembe-oil-spill/",
        "headline": "FIANACIAL ENERGY REVIEW: Aiteo Intensifying Clean Up of Nembe Oil Spill",
        "author": "Posted by:  admin",
        "date": "December 13, 2021",
        "paragraphs": [
            "Aiteo Eastern Exploration and Production Company says it is intensifying clean up from the Nembe oil spill after the leak was plugged.",
            "A statement by Mr Victor Okoronkwo, Aiteo’s Group Managing Director, said the Nov. 5, leak was stopped by collaboration driven by Nigerian experts.",
            "Okoronkwo said, “Indigenous participation in the Upstream space is nascent.",
            "“The efforts evident in the management of this incident, especially the remarkable Aiteo E&P Health Safety and Environment Policy, which mitigated adverse impact, was patriotic.",
            "“It foretells the progress that has been made in building, growing, and elevating both expertise and technical capabilities by indigenous oil companies such as ours.",
            "“The professionalism with which the technical and support personnel execute this significant operation cannot be overemphasised, especially, considering the challenging operating terrain.",
            "“The clean-up efforts that were concurrently executed throughout this period to limit the spread of hydrocarbon will now be comprehensively escalated.’’",
            "He said that concerted efforts would be channeled towards increasing remediation measures.",
            "Okoronkwo added, “In prosecuting the remediation activities and in aligning with Aiteo E&P’s strategic priorities, to ensure uninterrupted continuation of the living conditions and wellbeing of the communities remain the paramount consideration.’’",
            "Meanwhile, Prof. Richard Steiner, an Oil Spill Specialist, reacting to the plug of the leak, suggested that the well head be preserved for examination by independent experts.",
            "He said that this became necessary given the controversy that trailed the cause of the leak.",
            "Steiner called for the adoption of international best practices and transparency in the investigation of the cause of the incident.",
            "“There is a critical need to have the failed wellhead at Nembe OML29 preserved as evidence, and examined by independent engineers to determine cause of the failure.",
            "“If it is not preserved under rigorous chain-of-custody procedures, we will never know if it had been adulterated before the blowout or after or whether this was caused by simple equipment failure,’’ he said.",
            "While the oil firm said it suspected sabotage, the Bayelsa State Government and impacted communities claimed the spill was caused by equipment failure.",
            "However, the National Oil Spill Detection and Response Agency (NOSDRA) had urged parties to desist from making assumptions that would prejudice investigation.",
            "Mr Idris Musa, NOSDRA’s Director-General, had dismissed the positions held by parties on the spill as guess work.",
            "He said that only an evidence-based investigation led by the agency would determine the cause and volume of spill."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/11/12/national-assembly-to-get-62-million-out-of-16-2-billion-fg-proposed-offshore-loan/",
        "headline": "FIANACIAL ENERGY REVIEW: National Assembly to Get $62 Million for Solar Energy Out of $16.2 Billion FG Proposed Offshore Loan",
        "author": "Posted by:  admin",
        "date": "November 12, 2021",
        "paragraphs": [
            "The National Assembly will benefit $62.1m from the $16.2 billion Offshore loan being proposed by the Federal government which the regime of President, Muhammadu Buhari intend to borrow from international lending agencies.",
            "The amount, according to the report of the Senate Committee on Local and Foreign Debts, obtained by our correspondent on Thursday, would be used to construct a 17MW hybrid solar power plant.",
            "Also, the Ministry of Women Affairs, according to the document, would also benefit from a $100m loan meant for Nigeria for Women Projects.",
            "Buhari’s loan request was approved by the Senate on Wednesday.",
            "The National Assembly’s $16.2bn solar project would be funded by SINOCUTE Standard Chartered Bank",
            "The document added that, the actual amount of the project was actually $60.1m.",
            "The report was however, silent on the details of the remaining $2m.",
            "Part of the report read, “The committee notes that the Project includes, but not limited to construction of 17MW hybrid solar power plant for the use of the National Assembly Complex, Abuja.",
            "“The committee notes that the contract was awarded to SEPCOIII Electric Power Construction Co Limited and NEWTECH Global Network Limited as the Consortium at a total value of $60,120,000.“",
            "On the $100m loan for the Ministry of Women Affairs, “the Committee notes that the project is intended to support livelihoods for 324,000 women over the age of 18 years in targeted local Governments in Abia, Kebbi, Niger, Ogun and Taraba states.",
            "“The committee notes that each participating state receives $15m but Edo State declined participation in the project leaving five states instead of six.",
            "“The committee notes that the objective is to assist women enhance household income through grants and to meet specific life cycle needs and to mitigate some household expenses.",
            "“The committee further notes that the affected states have executed a Subsidiary Loan Agreement with the Federal Ministry of Finance, Budget and National Planning for the lending agreement.”"
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/11/09/kyari-wins-leadership-award-as-pprac-commends-transformation-of-nnpc/",
        "headline": "FIANACIAL ENERGY REVIEW: Kyari Wins Leadership Award as PPRAC  Commends Transformation of NNPC",
        "author": "Posted by:  admin",
        "date": "November 9, 2021",
        "paragraphs": [
            "The Group Managing Director (GMD/CEO) of Nigeria National Petroleum Corporstion (NNPC) Limited, Mallam Mele Kyari has been commended for transforming the fortunes of the NNPC from a position of loss-making into a profit- making venture. The Public Policy Research & Analysis Centre (PPRAC) gave this commendation while conferring its “2020 Zik Prize for Public Service Leadership’’ on the GMD, at the Eko Hotel, Lagos, at the weekend. At a well-attended event also witnessed by the Emir of Kano, Alh. Aminu Ado Bayero; Emir of Lafia, Justice Sidi Bage (rtd) and several other dignitaries, Kyari received the latest recognition from the Kebbi State Governor, Abubakar Atiku Bagudu. Speaking on behalf of the Centre, Chief Mac Wabara said Mallam Kyari was recognized following his distinguished leadership role and sterling achievements in the NNPC, which are all evident through the various reforms he instituted at the Corporation through transparency and accountability. He said: “Mele Kyari continues to seamlessly transform the operations of NNPC, including deepening domestic gas utilization, rehabilitation of the nation’s refineries and public disclosure of NNPC accounts, the first in NNPC’s 44 years of existence.” He added that Kyari’s greatest achievement, no doubt, was turning around the fortunes of the NNPC, from a loss of position, into a profit-making entity. “Under Kyari’s watch at the NNPC, the company declared a profit after tax of N287bn in 2020 after losses were reduced from N803bn in 2018 to N1.7bn in 2019. This is unprecedented in the history of the NNPC,” Wabara stated. He further explained that Mallam Kyari also consistently played a huge role in the enactment of the Petroleum Industry Act (PIA), stressing that with the coming of the legislation, the NNPC is now well-positioned to operate efficiently, like its global peers. Responding, Mallam Kyari said in the last two years, the NNPC has automated its processes and systems; reduced its costs of operations and focused on delivering value to Nigerians, in line with his Management vision of Transparency, Accountability & Performance Excellence (TAPE). He added that the enactment of the Petroleum Industry Act (PIA) has placed huge responsibility on the NNPC to do things differently and be much more accountable to its shareholders, the over 200 million Nigerians. He said the Zik Leadership award will spur him and his Management team to work harder towards becoming an International National Oil Company that is at par with its global peers. Other recipients of the prestigious Zik Leadership Award include the Lagos State Governor Babajide Sanwo-Olu; Nasarawa State Governor, Engr. Abdullahi Sule; former Secretary to the Government of the Federation, Chief Anyim Pius Anyim; Minister of State for Health, Senator Olorunimbe Mamora; Director-General and CEO of the Nigerian Maritime and Safety Agency (NIMASA), Dr. Bashir Jamo and MD/CEO of the Nigeria Sovereign Investment Authority (NSIA), Mr. Uche Orji. Established in 1994 by the PPRAC and now in its 26th edition, the Zik Prize in Leadership is aimed at highlighting Dr. Nnamdi Azikiwe’s legacy of patriotic fervor and nationalist vision."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/11/21/all-on-and-salpha-energy-sign-1-million-investment-pact-for-solar-home-systems-distribution-in-nigeria/",
        "headline": "FIANACIAL ENERGY REVIEW: All On and Salpha Energy  Sign $1 Million Investment Pact for Solar Home Systems Distribution in Nigeria",
        "author": "Posted by:  admin",
        "date": "November 21, 2021",
        "paragraphs": [
            "Shell-funded impact investment company, All On is pleased to announce a $1m investment in Salpha Energy Nigeria to scale the company’s solar home systems distribution business, focused on bottom-of-the-pyramid customers in rural and peri-urban areas across Nigeria including the Niger Delta.",
            "The investment will be used to increase Salpha’s inventory and product range, expand sales channels and customer service infrastructure, and test more flexible pricing models to sustainably manage rural customers in states across Nigeria including in the Niger Delta.",
            "“We are very excited about this support from All On which is an indication of their growing confidence in our vision. This additional support will allow us to deliver on our strategy to provide products for customers across the range of their developing energy needs",
            "“We are thrilled about this investment which is the continuation of a journey and would provide Salpha inventory needed to supply its expanding network of distributors and a platform to cement its competitive advantage and respond to growing market demand for Solar Home Systems,” said All On Senior Investment Associate, Goziem Okubor. “It’s also an opportunity to support young indigenous female entrepreneurs in building an exciting and fast-growing solar business” said Salpha Founder/CEO Sandra Chukwudozie.",
            "The company has an active distributor network of over 350 individuals, cooperatives, and traders nationwide with key partnerships with payment collection enablers such as InfiBranches, Paga, and Interswitch.",
            "All On’s contribution will enhance a highly scalable opportunity by speedily deploying power assets to households in Nigeria and facilitate the adoption of a sustainable power service payment culture within the Niger Delta and beyond.",
            "The deal is in addition to a $50,000 investment provided to Salpha as one of the winners of the USADF/All On Off Grid Energy Challenge in 2020. The funds were used to pilot Pay-As-You-Go contracts for customers in the Niger Delta."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/11/23/pia-will-serve-as-catalyst-to-develop-niger-delta-regions-chevron/",
        "headline": "FIANACIAL ENERGY REVIEW: PIA Will Serve as Catalyst to Develop Niger Delta Regions — Chevron",
        "author": "Posted by:  admin",
        "date": "November 23, 2021",
        "paragraphs": [
            "……….. Keep an open mind, support a new law to reap its benefits……..",
            "Chevron Nigeria Limited (CNL) weekend said that the Petroleum Industry Act as well as the Host Community Development Trusts (HCDT), would serve as a catalyst for the development of host communities in the Niger Delta region.",
            "The oil giant, therefore, urged community leaders, women and youths to support the PIA so that the communities could reap its benefits.",
            "General Manager, Policy, Government and Public Affairs (PGPA), Mr. Esimaje Brikinn, said this at the 2021 Annual General Meeting of the Amona Ilaje Ugbo Coastal Communities Development (AMAICOMMA), held in Ugbo, Ilaje council area of Ondo State.",
            "Brikinn noted that “the PIA would help consolidate on the successes achieved through the Offshore Memorandum of Understanding (OMoU) and Global Memorandum of Understanding (GMoU).",
            "Speaking through Chevron’s Communications Coordinator, Kayode Adeboye, Brikinn described the PIA as a “new thing which they sought to understand and ensure the continuation of community development in a participatory way.",
            "” l implore our community leaders, women, youths and other stakeholders to keep an open mind and continue to support this new law so that our communities can reap more benefits under the new dispensation.”",
            "He lauded AMAICOMMA for keeping with the principles of transparency and accountability as well as achieving most of its cardinal objectives including community empowerment and sustainable development.",
            "“We are also happy that AMAICOMMA has fostered peace and helped resolve conflicts in its communities. It id important to know that community development can only be sustained in an atmosphere of peace that is conducive for business activities.",
            "“As we all know, a key element of the OMoU is the peacebuilding which creates a platform for all stakeholders to address conflicts through dialogue without allowing them to degenerate into disruptive situations.”",
            "Managing Director of New Nigeria Foundation, Prof. Obafemi Ajibola, said the AGM was an opportunity to promote transparency and accountability within the CNL OMoU Governance Model.",
            "Ajibola expressed optimism that the skills and capacity building over the past would help them prepare for a peaceful and stress-free transition.”",
            "The AMAICOMMA Chairman, Mr. Taiwo Orisabinone, said the body has carried out free medical health services for the aged, pregnant women and children; skills acquisition programme for women and commenced construction of a Mother and Child Health Centre in collaboration with the Ilaje Regional Development Committee (ILRDC)",
            "Orisabinone thanked CNL for its continued funding of the OmoU and iterated its commitment to driving gender equality by promoting women’s participation in science; and giving back to the community.",
            "“I sincerely hope that we all will key into the Petroleum Industry Act (PIA) for a better future for the good people of the oil-bearing communities as soon as the coast is clear.”",
            "The Olugbo of Ugboland, Oba Frederick Akinruntan who was represented by the Baale of Agbede Community, Chief Omotehinse Mogohen, commended CNL and AMAICOMMA for their contributions to the development in the oil rich llaje community."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/11/20/407-13-million-litres-of-petrol-available-in-lagos-depots-nmdpra/",
        "headline": "FIANACIAL ENERGY REVIEW: 407.13 Million  Litres of Petrol Available in Lagos Depots – NMDPRA",
        "author": "Posted by:  admin",
        "date": "November 20, 2021",
        "paragraphs": [
            "The Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA) on Thursday said about 407.13 million litres of Premium Motor Spirit (PMS) was available at various depots in Lagos State.",
            "The Authority also advised motorists and Lagos residents not to engage in any panic buying of PMS, also known as petrol, because there was no fear of scarcity of petroleum products ahead of the Yuletide season.",
            "Mr Ayorinde Cardoso, Zonal Operations Controller, NMDPRA, Lagos, made these known during a surveillance exercise on some petrol stations across the state.",
            "Some of the filling stations visited were within the Mainland and Island axes of the state.",
            "He said: “We are going out to carry out our usual surveillance and the purpose of this is to assure the public that we have sufficient product.",
            "“We have been getting information that there is scarcity in some parts of the federation but for Lagos, we have sufficient product.",
            "“As at this morning, we have about 407.13 million litres of PMS. So there is no need for any panic buying by members of the public.”",
            "Cardoso said apart from product availability, the surveillance exercise was to ensure that there was no under-dispensing of petroleum products by filling stations.",
            "The zonal controller noted that the inspection team was also checking product quality due to recent reports of water ingress in some tanks of filling stations in Lagos.",
            "He said it was also to ensure that the filing stations were operating in compliance with the prerequisite safety standards of the authority for the industry.",
            "According to him, the Authority has shutdown 425 petrol stations from January to October for various infractions including under dispensing, safety breaches as well as operating without valid licenses.",
            "Cardoso, therefore, warned marketers to desist from hoarding of products and other nefarious activities, stressing that the authority would not hesitate to sanction such erring stations.",
            "He said: “I want to assure the public that the sufficiency level in Lagos State is okay and for now we have not seen any hoarding of products.",
            "”Surveillance is a regular assignment for us and our officials are going round every day for that purpose.”"
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/12/10/nigeria-committed-to-achieving-carbon-neutrality-using-abundant-gas-resources-nnpc/",
        "headline": "FIANACIAL ENERGY REVIEW: Nigeria Committed to Achieving Carbon Neutrality Using Abundant Gas Resources – NNPC",
        "author": "Posted by:  admin",
        "date": "December 10, 2021",
        "paragraphs": [
            "The Group Managing Director of the Nigerian National Petroleum Company Ltd, (NNPC) Mele Kyari has said that Nigeria is committed to achieving carbon neutrality using her abundant natural gas resources as a low carbon alternative that will help improve access to energy to power the Nigerian economy.",
            "Kyari pointed out that with some of the initiatives being implemented by the Corporation, the nation’s energy transition will be more impactful using Nigeria’s available natural resources.",
            "Kyari said this in his industry keynote address which was delivered on Wednesday at the Nigerian Day-Energy Forum held at the side-line of the 23rd World Petroleum Congress in Houston, United States.",
            "Kyari who was represented at the event by the Group Executive Director, Upstream, Engr. Adokiye Tombomieye, spoke on the theme, “The new realities for the world oil and gas industry.”",
            "The event is coming at a time when the world is confronted with multiple challenges such as resurgence of COVID-19 pandemic and the fast-spreading Omicron variant; vaccine hesitancy in some Western capitals and vaccine insufficiencies in some developing countries; climate change on the front burner and rising geopolitical tensions These challenges are more manifested in some parts of the world than in others.",
            "But their collective impacts when superimposed on the drive for accelerated energy transition is enough to paint the new reality that confronts the global oil and gas industry.",
            "However, he maintained that inspite of all these challenges Nigeria will in no distant time become a net exporter of petroleum products.",
            "The GMD said while the COVID-19 pandemic has remained a hurtful experience that shocked the global economy and the oil industry, negative financial position and poor liquidity experienced during the heat of the pandemic has made funding of both existing and new projects impossible as companies cut their spending to survive.",
            "However, he said the success of vaccine development has renewed world confidence to reopen the economy once again.",
            "This reopening, he noted, has increased oil demand with prices surging above pre-pandemic levels after crashing to a single digit due to over supply and demand destruction in 2020.",
            "With the opening of major economies and the rebound of oil demand, Kyari said prices have escalated to three-year high due to disproportionate supply.",
            "In the midst of these growing uncertainties, he told participants at the event that building mutually beneficial partnerships has remained the best choice that stakeholders can make to keep their respective visions alive.",
            "Building on this convergence, the NNPC GMD said Nigeria as a key player in global oil industry has, with the enactment of the Petroleum Industry Act 2021, taken major step to address challenges associated with fiscal, security and cost competitiveness."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/12/01/nigeria-needs-to-intensify-efforts-towards-harnessing-the-huge-gas-resources-shell-boss/",
        "headline": "FIANACIAL ENERGY REVIEW: Nigeria Needs to Intensify Efforts Towards Harnessing the Huge Gas Resources – Shell Boss",
        "author": "Posted by:  admin",
        "date": "December 1, 2021",
        "paragraphs": [
            "The Country Chair of Shell Companies in Nigeria, Mr. Osagie Okunbor has said that it has become necessarily for Nigeria to intensify efforts toward harnessing the 802trillion cubic feet of gas reserves – 202 trillion cubic feet of proven gas reserves and about 600 trillion cubic feet of unproven reserves.",
            "This, Okunbor said is key in the next decade of the nation’s existence and relevance in the global energy space.",
            "The Shell boss further said that Nigeria should adopt a two-pronged strategy in her approach to the global energy transition campaign.",
            "Okunbor, while delivering the 51st Founders’ Day Lecture of the University of Benin, advised that Nigeria response to global call to reduce exploitation of fossil fuels and production of Green House Gases (GHG) should be well thought-out and strategic",
            "The Shell Country Chair while delivering the 51st Founders’ Day Lecture of the University of Benin titled: ‘The Global Energy Transition and The Imperatives for Nigeria,’ called for an urgent optimisation of Nigeria’s energy resources for a speedy economic and industrial development of the country,",
            "A statement by Bamidele Odugbesan, Shell Media Relations Manager said that Nigeria has gas in abundance about 202 trillion cubic feet of proven gas reserves and about 600 trillion cubic feet of unproven reserves.",
            "The statement noted that harnessing these huge gas resources, and on time too, is key in the next decade of Nigeria’s existence.",
            "According to Shell boss the second approach for Nigeria’s successful energy transition would be an intentional growth of the off-grid power and renewables industry taking advantage of foreign financial support and technology transfer.",
            "“The ongoing energy transition is here with us. As with other transitions, it is a journey that will involve multiple approaches, collective action and undoubtedly present new challenges and opportunities. Nigeria is well positioned to ride the wave of the current energy transition with its abundance of natural fossil fuels and renewable solar energy. We need to move with a greater sense of urgency and a clear sense of direction,” he said.",
            "Okunbor, who is also the Managing Director of The Shell Petroleum Development Company of Nigeria Limited (SPDC), said, “Nigeria, as a country with abundant natural fossil fuel resources, cannot afford for international and multilateral agencies to stop funding the development of fossil fuels, particularly gas projects.”",
            "“The transition is underway,” Okunbor said, “but it will move at different paces and produce different outcomes in different countries depending on local factors. Society, as a whole, faces a dual challenge to transition to a low-carbon energy future, dealing with how to manage the risk of climate change, while also extending the benefits of energy to everyone on the planet. This is a challenge that requires changes in the way energy is produced, used and made accessible to people.”",
            "Despite the efforts at decarbonisation, Okunbor said oil and gas would remain in the energy mix for some decades to come. “This is partly a consequence of the time needed for renewables to reach the necessary level of materiality. In part, it is also a consequence of the lack of substitution options in some parts of the economy. But the world will need to meet its energy needs at the same time as it tackles climate change.”",
            "He noted that to make the Federal Government’s Decade of Gas agenda a success, the country would need to unlock the domestic gas-to-power value chain; accelerating infrastructure development; drive gas-based industrialisation; and deepen domestic liquefied petroleum gas penetration.",
            "In addition, he said there was a need to build a stable regulatory environment anchored on a willing-buyer-willing-seller pricing regime; grow the export and regional gas market; and build local capacity and content for contractors and professionals in the gas sector.",
            "He said “A transformation of the global economy is required, especially in the power sector, transport, buildings, and industry – four main areas where energy is consumed and that produce a significant proportion of energy-related emissions of CO2.",
            "He also advocated a significant shift in the consumption of energy in power, transportation, buildings and industry as key areas that will determine the long-term energy mix. “To tackle climate change, power generation, for example, must evolve to use a combination of more renewable sources of energy, as well as natural gas – the cleanest-burning of the hydrocarbon fuels.”",
            "On how Shell was responding to the challenge of access to energy and the global drive to grow the renewable energy sector, Okunbor said the global energy giant had made significant targeted investments on the platform of Shell’s Energy Access team and the Shell-seeded impact investing company, All On, to help close Nigeria’s energy gap.",
            "“So far, All On has invested over $21mln in 40 off-grid energy companies in Nigeria and has driven over 40,000 solar connections across Nigeria to date,” he said."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/11/17/nupeng-issues-fg-two-week-ultimatum-threatens-strike-over-workers-welfare/",
        "headline": "FIANACIAL ENERGY REVIEW: NUPENG Issues FG Two-week Ultimatum, Threatens Strike Over Workers’ Welfare",
        "author": "Posted by:  admin",
        "date": "November 17, 2021",
        "paragraphs": [
            "NUPENG said it would commence a nationwide strike if some legitimate welfare and membership-related issues are not conclusively addressed at the end of the period.",
            "The ultimatum was contained in a statement released on Monday and signed by Williams Akhoreha, NUPENG president, and Olawale Afolabi, general secretary.",
            "The union had reached its decision during a special national delegates conference convened last Thursday.",
            "It listed reasons for its resolution to include non-payment of workers’ salaries, title benefits, among others.",
            "“We write to convey to the general public and all relevant government agencies the resolution of the special national delegates conference to issue a 14-day notice of a nationwide industrial action if some legitimate welfare and membership related issues that have been variously resolved in our favour even by the Federal Ministry of Labour and Employment are not adequately and conclusively addressed and resolved within the next 14 days. This ultimatum takes effect from Monday, November 15, 2021,” the statement reads.",
            "Outlining some of the issues, the union said the first one was the outstanding short payment of terminal benefits to its members that were declared redundant in 2012 by the management of Chevron Nigeria Limited.",
            "It also accused the management of Chevron of terminating the employment of contract workers for joining the union.",
            "This, it said, was despite the fact that the workers had put in between 10 to 20 years in continuous employment and that their jobs were terminated without payment of terminal benefits.",
            "“There is also the matter concerning PYRAMIDT workers, who for more than 20 years now are being moved from one labour contractor to another without conditions of service and union representation/recognition,” NUPENG added.",
            "The union said that contract workers working in oil mining licence (OML) 42 of the Nigeria Petroleum Development Company (NPDC), an upstream subsidiary company of the Nigerian National Petroleum Corporation (NNPC), were being continuously owed salaries and allowances for upwards of eight to 10 months.",
            "NUPENG said efforts to make the management of the NPDC and the contractors do the needful on the pitiable plights of the hapless workers had yet to receive any meaningful attention and actions.",
            "“Nigeria Agip Oil Company (NAOC) and its Contractors are also owing Contracts Workers’ salaries and allowances for upwards of 10 months,” the statement adds.",
            "“These workers are being denied salaries and allowances on very inhuman and wicked excuses that the contractors are yet to fulfill certain due process, yet this due process is not stopping NAOC from exploiting the skills and sweats of these Nigerians for profits while the workers and their families are wallowing in hardship and poverty.",
            "“In a similar manner, NAOC has since early 2020 been using the excuse of COVID-19 to keep several of our members away from work while using casual/daily paid workers to do their work even while there is a subsisting contract.",
            "“The Special National Delegates Conference in session noted with deep disappointment that despite the fact that these issues have been tabled before different government agencies/institutions and they have been resolved, the decisions remain unimplemented while our members keep suffering in excruciating jeopardy.",
            "“It was therefore resolved and directed that these issues do not require any further meetings or negotiations but decisive actions and implementation of all established issues within the period of our notice to all concerned.”"
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/11/23/nmdpra-to-continue-petrol-bridging-programme/",
        "headline": "FIANACIAL ENERGY REVIEW: NMDPRA To Continue Petrol Bridging Programme",
        "author": "Posted by:  admin",
        "date": "November 23, 2021",
        "paragraphs": [
            "The Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA) will continue implementing the petroleum bridging programme to boost the availability of the product nationwide.",
            "The Chief Executive Officer (CEO) of the Authority,Farouk Ahmed, who disclosed this in Abuja on Sunday, explained that the Authority will also offset all the bridging verified claims by all the stakeholders in the distribution of Premium Motor Spirit (PMS) in the country.",
            "The NMDPRA has assured petroleum tanker drivers and other stakeholders of The Authority’s determination to continue the payment of bridging rate to ensure effective distribution of products nationwide.",
            "The CEO also revealed that the Nigerian National Petroleum Company (NNPC) Limited has stopped charging in dollars for their shipping services.",
            "Ahmed added that both the Nigerian Ports Authority (NPA) and Nigerian Maritime Administration and Safety Agency (NIMASA) are expected to also begin to charge for their services in Naira very soon as the two agencies of government have started engaging the Ministry of Transportation to get necessary approval.",
            "The CEO urged indebted marketers that collect bridging levies provided for in the pricing template to remit such deductions to enable the Authority pay outstanding claims.",
            "The stakeholders met in Lagos on the 9th November, 2021 where it was agreed that all the stakeholders should fulfil their mandates to ensure seamless distribution of petroleum products nationwide as the yuletide season approaches."
        ]
    },
    {
        "url": "https://financialenergyreview.com/2021/12/04/pia-the-needed-panacea-to-attract-investments-iocs/",
        "headline": "FIANACIAL ENERGY REVIEW: PIA the Needed Panacea to Attract Investments – IOCs",
        "author": "Posted by:  admin",
        "date": "December 4, 2021",
        "paragraphs": [
            "The international oil companies (IOCs) operating in Nigeria have once again expressed satisfaction over the new legal framework for the oil industry- the PIA which they insist is the needed panacea for attracting investment into the Petroleum industry in Nigeria.",
            "The oil majors, who recognised the ongoing energy transition, its inevitability and impact on fossil fuels industry, however, called for caution and moderation among Nigerian players in their quest to move to new energies.",
            "Chief executives of the IOCs stated these at a panel session on, “Growth Levers and Investment Opportunities Arising from Nigeria’s Petroleum Industry Act,” at the ongoing 10th Practical Nigerian Content, organised by the Nigerian Content Development and Monitoring Board (NCDMB).",
            "The central theme of the four-day event holding both physically and virtually in Yenogoa, Bayelsa State, is, “Driving Nigerian Content in the New Dawn of the Petroleum Industry Act.”",
            "Speakers on the panel included the Managing Director of TotalEnergies EP Nigeria Limited, Mr. Mike Sangster; Chairman, Shell Companies in Nigeria, Mr. Osagie Okunbor; Managing Director of Chevron Nigeria Limited and Chairman of Oil Producers Trade Section (OPTS), Mr. Rick Kennedy; and Managing Director of Nigerian Agip Oil Company (NAOC), Mr. Roberto Daniele; amongst others.",
            "Speaking, Sangster, who was represented at the discourse by the Deputy Managing Director, TotalEnergies Deep-water, Mr. Victor Bandele, said the PIA had come at a better time, adding that his organisation was one of the biggest beneficiaries of the Act.",
            "He said the Act has paid greater attention to gas, which according to him, is a transition fuel for Nigeria and very critical to the government’s drive to industrialise the nation.",
            "Sangster explained that TotalEnergies worldwide was becoming a multi-energy company, stating that the company’s energy mix will change significantly in the coming years.",
            "He said, “Currently, our production is about 55 per cent oil, 40 per cent gas, and five per cent electricity. But by 2030, it will be 50 per cent gas; 35 per cent oil; and 15 per cent electricity.",
            "“By 2050, the mix is targeted to be 40 per cent renewable power, 40 per cent gas (primarily carbon-free) and 20 per cent liquid products. Out target is to get to Net Zero in all our operations worldwide by 2050. We are committed to this target and working with all our stakeholders, we believe we can deliver cleaner, more affordable, and more available energy to as many people as possible.”",
            "Kennedy, who was represented by Chevron’s Director of Business Services, Mr. Cosmas Iwueze, said the PIA has done a lot in terms of liberalising gas, adding that gas is a transition fuel for them.",
            "He said, “The world economies have to be powered and gas is major transition fuel. So, we are focusing on lower sources of energy. The PIA has really done a good job by liberalising gas.”",
            "Also, Okunbor said the PIA has created an enabling environment for investment to thrive, noting that in the past, discussions had been about enduring certainty in the Nigerian oil and gas industry.",
            "He said industry players should take energy transition very important because of its impact on oil and gas, pointing out that over 55 per cent of Nigeria’s foreign earnings come from oil."
        ]
    }
]